[
  {
    "id": "7038cf95-f4b0-4986-9d20-d6e683d6854e",
    "name": "CAPTAIN MARVEL",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/008cmv_ons_crd_04.jpg",
    "bio": "CAROL DANVERS\nCAPTAIN MARVEL\nWhen head of NASA security Carol Danvers was exposed to a powerful alien device, she transformed into the mighty cosmic powered hero, Captain Marvel!\nOVERVIEW\nIN COMICS PROFILE\nIN COMICS FULL REPORT\nBIOGRAPHY\nCAPTAIN MARVEL\n\nFormer Air Force pilot and intelligence agent Carol Danvers pursued her dream of space exploration as a NASA employee, but her life forever changed when she was accidentally transformed into a human-Kree hybrid with extraordinary powers.\n\nNow, Carol is the latest warrior to embrace the mantle of Captain Marvel, and she has taken her place as one of the world’s mightiest heroes.\n\nHigher, Further, Faster, More\n\nAs a NASA security officer, Carol investigated numerous attempts made by the Kree and Skrulls to infiltrate Kennedy Space Center and disrupt America’s space program. During a battle between the heroic Mar-Vell and his rival, Yon-Rogg, Carol was exposed to the Psyche-Magnitron, a Kree device that could make imagination into reality. Carol subconsciously envied Mar-Vell’s powers, and the machine responded to those desires by rewriting her DNA to make her a human/Kree hybrid with abilities similar to his.\n\nCarol took on the identity of Ms. Marvel and even fought alongside Mar-Vell/Captain Marvel and the Avengers. Her early career was cut short when Rogue, a member of the Brotherhood of Evil Mutants, attacked Carol and permanently drained her powers and memories. It took years for Carol to recover from her ordeal, but she finally achieved her dream of space exploration and traveled far from Earth. Carol even became cosmically empowered and took on the codename Binary.\n\nThe Binary powers faded over time, leaving Carol with most of her original abilities. Carol returned to Earth and rejoined the Avengers. Years later, Carol adopted the codename Captain Marvel as a tribute to her fallen friend and mentor. Her prominence has also grown exponentially, and Captain Marvel is now the most popular heroine in the world.\n\nBird of War\n\nCarol Danvers was already in excellent shape before she was transformed by the Psyche-Magnitron. Afterwards, Carol’s body was pushed to the peak of human fitness and modified with Kree DNA. Her powers include enhanced strength, stamina, agility, and durability, as well as flight, and almost total immunity to toxins and poisons. Carol also has a “seventh sense” which gives her precognitive flashes of the future, but the power randomly manifests and has largely faded away.\n\nAs Binary, Carol’s connection to the power of a white hole allows her to generate and control any form of radiation or gravity, as well as the ability to survive and travel in space without the protection of a spacesuit. Although the vast majority of Carol’s Binary powers have been lost, she still retains the ability to absorb energy and fire photonic blasts from her hands. If Carol is exposed to enough energy, her full Binary powers have the potential to temporarily reemerge.\n\nMarvelous Menaces\n\nMichael Rossi is Carol Danvers’ first mentor, and later, her lover. But, he was also secretly working with a terrorist named Ghazi Rashid, who captured and tortured Carol during a covert mission. Years later, Rossi admitted he was grooming Carol to be his mole for the Air Force Special Operations. Rossi also betrayed Carol to Norman Osborn and delivered her to Rashid, after he had been enhanced with powers of his own.\n\nAs a heroine, many of Carol’s deadliest foes are of Kree origin, including Ronan the Accuser, the Supreme Intelligence, Yon-Rogg, Doctor Minerva, and Doctor Eve. Deathbird of the Shi'ar has been a constant nemesis for Carol, but Mystique, M.O.D.O.K., and Moonstone also have a long history with her.\n\nImmortus’ son, Marcus, struck at Carol with his warped sense of love, as he brainwashed her and made Carol love him after abducting her to Limbo.\n\nCarol also has very good reasons to hate Rogue. Before she joins the X-Men, Rogue accidentally drains Carol of her powers and memories. Since Rogue has redeemed herself as a heroine, Carol’s stance towards her has softened. They even teamed up during the Avengers’ war with the X-Men, but Carol may never fully forgive Rogue for violating her so deeply.\n\nCarol’s Corner\n\nDuring her espionage days, Carol befriends Wolverine, Nick Fury, and Ben Grimm (the Thing). She eventually aligns herself with the Agent (Rick Mason), although they are initially on opposite sides. Since adopting her original Ms. Marvel identity, Carol has become close friends with Spider-Woman (Jessica Drew), Jessica Jones, and Wonder Man, as well as other members of the Avengers. Carol is also an inspiration for the current Ms. Marvel, Kamala Khan.\n\nWhen Carol is in charge of Operation: Lightning Storm, she takes Spider-Girl/Araña (Anya Corazon) under her wing and accepts Machine Man as her teammate. Carol also joins the Starjammers, Guardians of the Galaxy, the Ultimates, and A-Force, while forging close connections with them as well. At one point, Carol also has a romantic relationship with War Machine (James Rhodes), but their time is cut short by his tragic demise.\n\nMore recently, Carol serves as commander of the Alpha Flight space station with Abigail Brand and three original Alpha Flight members: Aurora, Puck, and Sasquatch. Additionally, Carol adopts a cat named Chewie, which is actually a Flerken, an alien species that resembles felines from Earth. A young Kree girl nicknamed Bean has also earned her place in Carol’s heart. Carol feels very protective towards Bean, and she even traveled to an alternate universe to bring her home safely.\n\nHEIGHT\n\n5'11''\n\nWEIGHT\n\n165 lbs.\n\nGENDER\n\nFemale\n\nEYES\n\nBlue\n\nHAIR\n\nBlonde\n\nUNIVERSE\n\nMarvel Universe\n\nOTHER ALIASES\n\nAce, Binary, Lady Marvel, Warbird\n\nEDUCATION\n\nExtensive military training and acquired BA while in military\n\nPLACE OF ORIGIN\n\nBoston, Massachusetts\n\nIDENTITY\n\nPublicly known\n\nKNOWN RELATIVES\n\nMarie Danvers (mother), Joseph Danvers (father, deceased), Joeseph Danvers Jr. (brother), Steven \"Steve\" Danvers (brother, deceased), Benny (uncle)\n\nPOWERS\n\nFlightEnergy BlastsSuperhuman DurabilitySuperhuman Strength\n\nGROUP AFFILIATION\n\nAlpha FlightAvengersA-ForceKree\nDestined for Greatness\n\nWhen she was a young girl, Carol Danvers dreamed of becoming an astronaut and exploring the cosmos. However, Carol’s aspirations for higher education were thwarted by her father, who chose to send her younger brother, Steve, to college instead of her. Despite the setback, Carol graduated from high school at the top of her class and enlisted in the United States Air Force when she turned eighteen. Once again, Carol excelled and quickly rose through the ranks as one of the Air Force’s top pilots.\n\nDuring a reconnaissance mission over Afghanistan, Carol’s plane was shot down by insurgents led by Ghazi Rashid. Carol suffered a broken leg in the crash, and she was subsequently captured and tortured by Rashid and his men. Amazingly, Carol not only managed to escape, but she killed most of her captors as well. Air Force Special Operations officer Michael Rossi debriefed Carol, and was so impressed by her that he recruited her into Special Operations and began training her as a spy.\n\nAs Carol embarked on her new path, Michael became her mentor and her lover. She also crossed paths with Nick Fury, as well as Ben Grimm and Logan (James Howlett). Eventually, Carol left the spy world behind to pursue her original passion at NASA. She became the head of security at the Kennedy Space Center, where she met Dr. Walter Lawson, a man who was secretly the Kree spy known as Mar-Vell.\n\nMar-Vell became very close to Carol, and he developed a kinship for humanity while acting to protect the Earth. He was soon called Captain Marvel by the public and recognized as a hero. As both the Kree and the Skrulls attempted to infiltrate NASA, Carol investigated Mar-Vell’s human identity before she was captured by his Kree rival, Yon-Rogg. In the subsequent battle between Mar-Vell and Yon-Rogg, Carol was knocked into a Kree device called the Psyche-Magnitron. Somehow, the machine dramatically altered Carol’s DNA by making her half-Kree and giving her powers similar to Mar-Vell’s superhuman abilities.\n\nCarol’s career at NASA was devastated by the ongoing incursions and attacks. After being demoted well below her original position, Carol angrily resigned and wrote a tell-all book about her experiences. It quickly became a best-seller and opened the door for her new writing career. However, Carol’s life was complicated by the Psyche-Magnitron’s changes to her mind and body. She developed a split personality who went into action as Ms. Marvel, with a costume that resembled Mar-Vell’s outfit. Carol had no memory of her activities as Ms. Marvel, and she was alarmed by her blackouts and her missing time.\n\nOver the next few months, Carol became aware of her alter-ego, but her two personalities remained distinct and separate. That changed in the aftermath of a Kree attack, with a mind-altering device which backfired and unified Carol’s two personas. Now truly a new woman, Carol embraced her role as Ms. Marvel and rapidly became a prominent heroine. Carol was even invited to join the Avengers, which she readily accepted.\n\nCarol proved to be a formidable addition to the Avengers’ ranks, and she developed friendships with teammates Wonder Man and Scarlet Witch. Meanwhile, the mutant criminal Mystique became one of Carol’s personal adversaries when she murdered one of her close friends, Michael Barnett. Carol’s life took a turn for the worse when she was kidnapped and abducted to the realm known as Limbo. Carol’s captor was a man named Marcus, who claimed to be the son of Immortus, an enemy of the Avengers. Marcus brainwashed Carol into loving him, and then returned her to Earth where she would give birth to a new physical body for Marcus himself.\n\nOnce back with the Avengers, Carol had no memory of what occurred in Limbo and she was understandably alarmed by her sudden pregnancy and delivery. Marcus grew to adulthood within a matter of days and explained who he was and what had happened. Even after the truth was revealed, the Avengers allowed Carol to accompany Marcus back to Limbo. However, Marcus was unable to stop his accelerated aging and he soon died. Once again in command of her own mind, Carol found a way to escape Limbo and returned to Earth.\n\nCarol had quietly resumed her role as Ms. Marvel in San Francisco when she was attacked by Rogue, Mystique’s adopted daughter and a member of the Brotherhood of Evil Mutants. Rogue’s assault was vicious, but even she didn’t foresee the outcome of their encounter. Rogue’s powers of absorption spiraled out of control and permanently stole Carol’s memories and her powers. In a haze, Rogue attempted to murder Carol, but her life was saved by Spider-Woman (Jessica Drew).\n\nThanks to the efforts of X-Men founder Charles Xavier, Carol emerged from her coma with some of her memories, but none of the emotional bonds that came with them. She also angrily berated the Avengers for not seeing through Marcus’ lies when he took her back to Limbo. Bereft of her powers, Carol remained with the X-Men for a time and even briefly encountered Rogue during a mission to erase the government’s files on Xavier’s team.\n\nWhen the X-Men were captured by the alien Brood, Carol was experimented on due to her unique genetic structure. Somehow, they connected Carol to a white hole, and she emerged more powerful than ever before. Now calling herself Binary, Carol used her newfound energy abilities to help the X-Men defeat their mutual enemies. Once she arrived back on Earth, Carol was hit with the devastating news that Mar-Vell had died from cancer. Soon after, Carol felt betrayed when Xavier allowed Rogue to join the X-Men to help her deal with the overwhelming memories and persona she had absorbed from Carol.\n\nDeciding to leave Earth behind, Carol joined the Starjammers in space as they attempted to reinstall Lilandra Neramani as the leader of the Shi'ar. Carol remained with the Starjammers even after Lilandra was restored as Empress, but she was also drawn into the Kree-Shi'ar War and the Avengers’ Operation: Galactic Storm. Carol used her Binary powers to save Earth’s sun from a Kree plot, and nearly burned herself out in the process. Carol remained on Earth to recuperate, and she even briefly regained her lost memories and emotions during an encounter with the Stranger.\n\nOnce many of Earth’s heroes returned from the Onslaught incident, Carol was among the new incarnation of the Avengers. She reclaimed the second costume she’d worn as Ms. Marvel, though she changed her codename to Warbird. However, Carol hid her greatly diminished powers from the rest of the team and began drinking heavily. Eventually, Carol’s bad decisions caught up with her and she was court-martialed by the team. Carol angrily quit the Avengers before they could discipline or help her, and she relocated to Seattle.\n\nWhile settling into her new life, Carol’s writing career took off again. Her alcoholism also spiraled out of control, and she even attacked Iron Man when he attempted to help. During that conflict, Carol nearly crashed a passenger jet by recklessly throwing Iron Man into it. Together, the two heroes saved the plane, and Carol subsequently turned herself into the authorities while accepting full responsibility for her actions. As part of her suspended sentence, Carol was told to rejoin the Avengers and continue her treatment with Alcoholics Anonymous.\n\nNow fully in command of her faculties, Carol flourished with the Avengers. She became an instrumental member of the team when it became a global strike force. However, Carol was shaken during Kang’s invasion by his son, Marcus, a.k.a. the Scarlet Centurion. This was not the same Marcus who had violated Carol years before, but Carol found the physical similarity between the two men to be extremely unnerving. It didn’t help that this Marcus was instantly attracted to her.\n\nMarcus was so enamored with Carol that he actually helped her seize control of the Master of the World’s defense systems even though it was in direct opposition of Kang’s plans. For that betrayal, Kang eventually killed his son. Following Kang’s defeat, Carol demanded that the Avengers hold her accountable for killing the Master during her assault on his base. However, they quickly cleared her of any wrongdoing. Shortly thereafter, Carol was recruited for a prominent position in the Department of Homeland Security.\n\nDespite believing the DHS to be the best use of her powers and skills, Carol quickly grew disenchanted with the organization and the political games it entailed. During the House of M incident, Carol experienced a world where she was Earth’s most popular heroine as Captain Marvel. When reality was returned to normal, Carol retained her memories of that alternate life and resolved to redefine herself as a heroine. She subsequently quit the DHS and resumed her Ms. Marvel identity.\n\nMonths later, Carol was drawn into the first Super Hero Civil War on Iron Man’s side as a prominent supporter of the Superhuman Registration Act. Working closely with S.H.I.E.L.D., Carol formed her own team, Operation: Lightning Storm, and she was also named the leader of a new group of Avengers. During this time, Carol also became romantically involved with Wonder Man. However, Carol’s powers were slowly becoming unstable, and she was unprepared for the Skrull invasion that nearly conquered the Earth. In the aftermath, Tony Stark was ousted from S.H.I.E.L.D. while Norman Osborn assumed control of H.A.M.M.E.R. and his own team of Avengers. Carol resigned from the Avengers in protest and joined Luke Cage’s renegade team of Avengers. In the midst of this, Osborn had Moonstone begin wearing one of Carol’s original costumes, while calling herself Ms. Marvel.\n\nOsborn took a personal interest in destroying Carol, and he discovered her history with Rossi and Rashid. Osborn recruited Rossi to his side and gave Rashid superhuman abilities before goading Carol into a fight that would claim her life. Carol was able to defeat Rashid in battle, but her unstable powers caused her body to explode and she was thought to be dead. In reality, Carol’s energies reformed as two different people: Ms. Marvel and Catherine Donovan, a successful writer who was free from her responsibilities as a heroine. Subsequently, Carol’s two halves were once again merged, and she soundly defeated Moonstone in a battle for control of her legacy.\n\nAfter the fall of Osborn, Carol was once again an Avenger. During the Avengers’ war with the X-Men, Carol was sent on a mission to space where she encountered Mar-Vell, who had been resurrected by a Kree Minister who utilized a portion of the Phoenix Force. While Mar-Vell and Carol briefly fell under the Minister’s sway, she resisted his control and Mar-Vell once again sacrificed his life for his people. Moved by Mar-Vell’s actions, Carol took the Captain Marvel codename as a tribute and she adopted a brand-new costume as well.\n\nAs Captain Marvel, Carol’s status among her fellow heroes grew exponentially. But her rise was not without a cost. Carol discovered that she had a brain lesion which threatened to destroy her memories if she used her powers to fly. At the same time, Yon-Rogg resurfaced and stole a piece of the Psyche-Magnitron that Carol had kept as a keepsake. Yon-Rogg used the Psyche-Magnitron to empower himself and utilized its connection to Carol’s brain to form a Kree city over New York City. To disrupt the plan and save the city, Carol flew into orbit and suffered massive brain damage. Her internal injuries were subsequently healed but her personal memories were lost.\n\nAdrift and no longer sure who she was, Carol joined the Guardians of the Galaxy for new adventures in outer space. When she returned to Earth, Carol joined S.H.I.E.L.D. in the hunt for the Illuminati as the multiverse faced its imminent destruction. Carol also became romantically involved with War Machine (James Rhodes) before the Avengers came to an uneasy truce with the Illuminati. The short-lived armistice wasn’t enough to save reality, but Carol was among a handful of heroes to take shelter in a specially made ship designed to survive the end of everything.\n\nDuring the Secret Wars that followed, Carol found herself as a prisoner of Mister Sinister in his realm on Battleworld. Although Carol was experimented on and tortured, she subsequently turned the tables on Sinister and convinced him to go against the God Emperor, Doctor Doom. Carol also took part in the final battle, which led to the restoration of the multiverse.\n\nIn the newly rebuilt reality, Carol was busier than ever. She co-founded A-Force, a team of all-female Avengers; joined the Ultimates, a Super Hero team designed to tackle the impossible problems; and she became the commander of the Alpha Flight Low-Orbit Space Station, Earth’s first line of defense against alien invasions. Subsequently, Carol became obsessed with a young Inhuman known as Ulysses, and his power to predict the future with a high degree of accuracy.\n\nFollowing Ulysses’ warning about Thanos, Carol gathered a team of heroes to face the Mad Titan. Although they managed to subdue and capture Thanos, the battle claimed the life of her lover, James Rhodes, and left She-Hulk in a coma. Rhodes’ death enraged Tony Stark and set the stage for the second Super Hero Civil War. Carol emerged as the leader of a large faction of heroes who favored using Ulysses’ powers to prevent disasters and crimes from occurring, while Stark rebelled against it.\n\nThe heroes were once again torn apart by conflict, and Stark was rendered comatose during his final battle with Carol. Ulysses subsequently ascended to a higher level of existence, while Carol became the most popular heroine on Earth, with a fictional television series based on her life. While dealing with refugees from the destroyed Kree home world, Hala, Carol befriended a young Kree girl, nicknaming her Bean. A Kree scientist known as Doctor Eve inserted herself into Carol’s life as a psychiatrist and used Bean’s effect on Carol to disrupt her powers. While saving Bean from Eve’s experiment, the young girl became a being of pure energy and disappeared.\n\nCarol was so distracted by her other issues that she was completely blindsided by Captain America when he engineered a Hydra coup and seized control of the Earth for his Secret Empire while leaving Carol and Alpha Flight locked out of the planet. To complicate things even further, Carol and her forces had to fight off a seemingly unending wave of Chitauri. Eventually, the real Cap emerged to take on his Hydra doppelganger. But the Alpha Flight station was destroyed during the conflict, essentially grounding Carol on Earth.\n\nSoon after, Carol received a cryptic message from Bean that led her to follow the child and Dr. Eve into a parallel universe, where she discovered the Reality Stone of her universe had been hidden away. Dr. Eve convinced Bean that it was her destiny to use the Reality Stone to transport the Hala from the parallel universe to her original universe. Fortunately, Carol was able to make Bean see reason, and they returned to the prime universe together with the Reality Stone in tow.\n\nAs forces gathered the Infinity Stones together, Carol was once again drawn into an intergalactic conflict. Back on Earth, Carol was invited to rejoin the Avengers alongside Captain America, Iron Man, Thor, She-Hulk, Black Panther, Doctor Strange, and Ghost Rider (Robbie Reyes).\n\n6\nDURABILITY\n6\nENERGY\n4\nFIGHTING SKILLS\n3\nINTELLIGENCE\n5\nSPEED\n5\nSTRENGTH"
  },
  {
    "id": "60a45855-8e07-4ec2-8c9a-b0064c54bf26",
    "name": "THANOS",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/019tha_ons_crd_03.jpg",
    "bio": "THANOS\nThe Mad Titan Thanos quests across the universe in search of the Infinity Stones, intending to use their limitless power for shocking purposes.\nOVERVIEW\nON SCREEN PROFILE\nON SCREEN FULL REPORT\nIN COMICS PROFILE\nIN COMICS FULL REPORT\nBIOGRAPHY\n\nHe is perhaps the most evil, bloodthirsty, and powerful villain in the universe—so powerful that religious sects have worshipped him as a god. His enemies include nearly every Super Hero in existence. He is obsessed with Goddess Death and has waged genocidal campaigns in an attempt to placate her. Most famously, he has attempted to conquer the universe by wielding the Infinity Gauntlet. He is the Mad Titan.\n\nHe is Thanos.\n\nDivine Right\n\nAs both god and ruler of the Endless Resurgence empire, Thanos controlled his people through a combination of force and fear, viewing freedom as disorder, as a hole in the universe that allows for in randomness and chaos. He saw death as an end to uncertainty, and so, he loved it. Thanos viewed his reign as the natural order of thing. To him, fate and chance are always at war, and his rule demonstrates the preeminence of fate. To help him with his domination, he once possessed a powerful cube that erased the will of his people. Unfortunately for him, he lost it under mysterious circumstances millennia ago, and has since been attempting to get it back.\n\nUnsurprisingly, many civilizations did not enjoy or want Thanos' brutal leadership. Thanos dealt with such uprising brutally, have his soldiers, the Ravens and the Bombardiers, and his sons, such as Gallowglass and Ronan the Accuser, quell any dissidence. For example, after the planet Pyx rose up against his rule, Thanos ordered Ronan to kill all males there over the age of 10.\n\nFrom his birth on Saturn's moon of Titan, Thanos was always an outsider. He carries a Deviants gene, which causes his gruesome and misshapen appearance, with purple, rugged skin. He was born among the last sons of Titan's original colonists: Mentor and Sui-San. His mother, shocked to see such an ugly baby, and sensing his potential for evil, tried to kill Thanos at birth, although she was stopped by his father, A'Lars, AKA Mentor. Thanos later killed her for this attempt. Thanos also has a brother, Starfox (AKA Eros), who he was always jealous of, as Starfox was handsome and popular.\n\nStill, Thanos is an Eternal, a type of super human who, according to the Celestials, was meant to be a protector of Earth. And, with a twisted mind, he took his cosmic duty to heart.\n\nOmnipotent(ial)\n\nThanos is immensely strong and resistant to injury, invulnerable to nearly all types of poison, disease, and telepathic attack. He also has incredible psychic abilities; he can sense things several star systems away. He can also possess the bodies of others—but he simply uses others as shells, channeling his power through a victim until his mind exhausts the host and kills them. Foregoing food and drink, he subsists entirely on cosmic energy.\n\nPerhaps Thanos' greatest ability is his capacity to rise from the dead. He can accomplish this by sacrificing others so he can live again or by biding his time in death, recharging his inner strength, so as to return more powerful and terrible than he was before. Thanks to his affinity for the Goddess Death, Thanos also claims he can transfer his followers' souls from one body to another and control what form their next life will take after they die. The Goddess also once granted him a techno-mystic chair, which allowed him instant transport across the universe.\n\nFoes, or Victims\n\nOne could argue that, as the Mad Titan maintains a dispassionate approach in his quest for order, all beings have been counted among his enemies. However, as the Super Heroes of Earth and their allies have presented the greatest and most difficult obstacles to Thanos' goals, they are foremost in his list of foes.\n\nChosen Few\n\nThe divine embodiment of Death is Thanos' greatest love and greatest inspiration. A Goddess of immeasurable might, who holds sway over life itself, Death and her quiet judgement of the universe have motivated, intoxicated, and confounded the Mad Titan for as long as he has traversed the universe.\n\nThe Black Order is a team of aliens that Thanos refers to as his \"children.\" The group, including Ebony Maw, Proxima Midnight, Corvus Glaive, Black Dwarf, and Supergiant, help him seek and destroy entire planets.\n\nMillions of years in the future of all that is, it is revealed that Thanos takes on a herald called the Cosmic Ghost Rider. Once an Earthly Spirit of Vengeance, this herald went through a long and difficult journey that ultimately led to his servitude alongside the god.\n\nHEIGHT\n\n6'7\"\n\nWEIGHT\n\n985 lbs.\n\nGENDER\n\nMale\n\nEYES\n\nRed\n\nHAIR\n\nBald\n\nUNIVERSE\n\nMarvel Universe\n\nOTHER ALIASES\n\nMad Titan, Master, Thanos Rex, Masterlord, Overmaster\n\nEDUCATION\n\nTutored by Mentor, schooled in Titan education system\n\nPLACE OF ORIGIN\n\nEternal colony, Titan (moon of Saturn)\n\nIDENTITY\n\nNo dual identity\n\nKNOWN RELATIVES\n\nSui-San (mother, deceased), A’Lars (Mentor, father), Eros (Starfox, brother), Numerous unidentified wives and offspring (all deceased), Kronos (paternal grandfather), Daina (paternal grandmother, deceased), Zuras (uncle, deceased), Cybele (aunt), Thena (cousin), Uranos (great uncle, deceased), Nebula (alleged granddaughter), The Rot (possible offspring, apparently destroyed), many others\n\nPOWERS\n\nSuperhuman StrengthSuperhuman DurabilityMagicMysticismBlack ArtsImmortality\n\nGROUP AFFILIATION\n\nBlack Order\nJourney to Infinity\n\nThanos' most storied attempt at subjugating the entire universe came with his pursuit of the Infinity Gems. In his search, he was turned to stone by the Avengers, Spider-Man, and Adam Warlock, but was revived by Death. Then, gathering all six Infinity Gems (Soul, Power, Time, Reality, Space, and Mind) from In-Betweener and various Elders of the Universe, he wiped out half the universe as a gesture to Death. Ironically, she rejected this offer, claiming that he was now her superior. Simply put, Thanos had gained Death's submission, but not her love.\n\nThe Avengers attempted to fight him, but he swatted them, as well as Galactus and Eternity, away. He was finally defeated after his granddaughter, Nebula, stole the Infinity Gauntlet from him, robbing him of his power—but now the power was in her hands, and she was no better than her grandfather. Adam Warlock recruited Thanos to help defeat her, which he did after realizing that he was unworthy to wield such power. They tricked her into restoring the universe as it was and wrested the Gauntlet from her control.\n\nAfterwards, Thanos spent some time as a lowly farmer, reflecting on his past misdeeds. Adam disassembled the Gauntlet and entrusted this new and self-aware Thanos to safeguard the Reality Gem, making him a member of the Infinity Watch. While a part of this new group, Thanos redeemed himself by protecting the gems against Magus, an evil version of Adam Warlock who made subservient doppelgangers of super powered beings like the Mad Titan. Death came to him and offered her allegiance if he were to kill Warlock, but he surprisingly declined and fought against Magus, who was eventually absorbed into the Soul Gem by Adam.\n\nWarlock later formed Goddess, a female cosmic hero who wanted to return all of existence to the original \"Cosmic Egg,\" a collection of several Cosmic Cubes, but Thanos united with Warlock once more to defeat her. Even Mephisto helped them in exchange for one of the Cubes after Goddess was defeated. When this eventually came to pass, he gave Mephisto a powerless cube and dismantled the rest, promising that if he ever again sought universal power, it would not be flawed. He would even later lecture Galactus on the dangers of too much pride. Not long after, he attempted to cure Thor after the Thunder God had lost his sanity, but the attempt was in vain. He transported Thor back to Asgard where Odin took this as an act of war and fought an extremely destructive battle with Thanos. Even upon learning the truth, Odin did not thank Thanos for his reluctant altruism, but told him to leave and never return.\n\nKnowing that the universe would never trust him again, Thanos returned to his base and studied potential threats. He plotted strategies against himself by making the Thanosi—blends of android, clone, and mystical doppelganger that possessed powers, intelligence, and personalities echoing both Thanos and the other beings on which they were based. They were made of DNA or other essential forces from friends and foes alike.\n\nLater, Death revived Thanos once again after he was killed by Drax the Destroyer, who had been created with the sole purpose of defeating Thanos. Drax had been created when the human Arthur Douglas's spirit was placed into a powerful new body by Kronos and Thanos's father, Mentor. After his resurrection, Thanos created a team called Zodiac by giving suits of power to twelve humans. Working on his behalf, they discovered a Cosmic Cube with which he tried to destroy the Avengers, Guardians of the Galaxy, and the Elders. Instead of killing them, though, the Cube sent them all to the Cancerverse, a place where death no longer existed.\n\nA year later, Thanos was attacking Earth with the Black Order, a group of nefarious aliens assembled by the Titan. His goal was to murder his own son, Thane, who had been born to and raised as an Inhuman. Black Bolt, King of the Inhumans, preferred to have their home city of Attilan destroyed, however, rather than hand over Thane. The Avengers attacked Thanos, but it was Thane who defeated his father. Breaking free, he trapped Thanos in an amber cube, which subjected him to a state of perpetual living death.\n\nThanos seemed to finally gain Death's approval when he allied himself with Annihilus, handing over his armies, teleportation technology, and Galactus. Upon learning that Annihilus wanted to destroy all life in both the positive and negative matter universes, Thanos tried to release Galactus. Most unfortunately, Drax showed up and ripped out Thanos's heart, killing him. Still, the Mad Titan later appeared at Death's side as she witnessed Annihilus' defeat. His place next to her is believed to signify that she finally welcomed him with open arms.\n\nLater, after Thanos rose again, the Avengers decide to ambush the Titan due to a precognitive vision from the Inhuman known as Ulysses. In the fight, War Machine was killed and She-Hulk was mortally wounded. Devastated by the loss of his friend, Iron Man worked to make sure that no one used Ulysses' prognosticating abilities again. This put him at odds with Captain Marvel, who wanted to use the young Inhuman to stop tragedies from happening.\n\nRecently, Thanos discovered perhaps the only being in the universe that could defeat him permanently. That being, of course, was Thanos himself. In an event set millions of years into the future, at the beginning of the end of the universe, Thanos met his older self in one final quest to win the heart of Death. There could only be one suitor for her, however, so he was forced to fight himself for the Goddess' hand.\n\n6\nDURABILITY\n6\nENERGY\n4\nFIGHTING SKILLS\n6\nINTELLIGENCE\n7\nSPEED\n7\nSTRENGTH"
  },
  {
    "id": "48502fe5-15d6-482c-9a11-3c452181c188",
    "name": "BLACK PANTHER",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/007blp_ons_crd_02.jpg",
    "bio": "T'CHALLA\nBLACK PANTHER\nT’Challa is the king of the secretive and highly advanced African nation of Wakanda - as well as the powerful warrior known as the Black Panther.\nOVERVIEW\nON SCREEN PROFILE\nON SCREEN FULL REPORT\nIN COMICS PROFILE\nIN COMICS FULL REPORT\n3\nDURABILITY\n3\nENERGY\n5\nFIGHTING SKILLS\n5\nINTELLIGENCE\n2\nSPEED\n3\nSTRENGTH\nBIOGRAPHY\n\nFor generations, the people of Wakanda have followed and worshipped the Black Panther, a superior warrior granted extra abilities by the Panther God upon proving him or herself worthy in a combat tournament open to all Wakandans.\n\nWakanda stands apart from many nations because of its advanced technological nature, well-integrated with centuries-old traditions. Intent on keeping to itself for generations, the nation often rebuked visitors while also refraining from interfering in larger world conflicts. Wakanda’s greatest natural resource, Vibranium, provides Wakanda both independence and technological superiority. The vibration-absorbing metal is cultivated in the Great Mound.\n\nFor much of the modern era, T’Challa has worn the mantle of the Black Panther, acting as both Wakanda'’ champion and its king. However, unlike many of his predecessors, T’Challa often eschewed his peoples’ insular nature and journeyed out into the world—masked and unmasked—to become a hero to the entire globe and beyond.\n\nA Royal Beginning\n\nBefore becoming the Panther, T’Challa was simply the son of Wakanda’s king T’Chaka, a previous Black Panther. Unfortunately, his father ran afoul of the Vibranium-obsessed Ulysses Klaw, who ultimately brought about the king’s death. T’Challa would travel the world and study at the best universities, a journey that also united him with Ororo Munroe, the young woman who would become Storm.\n\nUpon returning to his homeland, T’Challa secretly took part in the open challenge to the current Black Panther—his uncle S’Yan—and defeated him. Upon revealing his true identity, the country reacted first with shock and then adulation as he took his rightful place in the community.\n\nWakandan Technology\n\nThough possessing no innate super powers, T’Challa is incredibly intelligent with a tactical mind that allows him to see the biggest of big pictures.\n\nThe Black Panther, however, wields enhanced strength and senses thanks to special heart-shaped herbs reserved solely for the post. The suit, which has changed in a variety of ways over the years, also features Vibranium enhancements that absorb impact, making him less susceptible to physical blows or gunshots. More concentrated Vibranium pads in the feet and hands allow for easier climbing.\n\nHomeland Adversaries\n\nBetween his careers as both a leader and a Super Hero, T’Challa has racked up quite the rogues gallery. His first true enemy came in the form of Klaw, who not only killed his father but continues to use his own sound-manipulating abilities to torment T’Challa. Erik Killmonger began life as a Wakandan by the name of N’Jadaka whose father's involvement with Klaw’s schemes led to the boy growing up in Harlem. Though he regained his Wakandan citizenship later, he never stopped hating T’Challa and continued his attempts to take over the nation of his birth.\n\nAnother Wakandan known as M’Baku also aimed to take control of the throne from the Black Panther. He aligned himself with the White Gorilla Cult and joined the Lethal Legion, but routinely failed to stop T’Challa. The Black Panther ran afoul of Doctor Doom after refusing to join in the Latverian leader’s Cabal. Doom responded by nearly killing T’Challa and attempting to steal all of Wakanda’s Vibranium.\n\nFamilies by Blood and Choice\n\nT’Challa learned a great deal from interacting with T’Chaka while he was alive. He also has a very close relationship with his stepmother Ramonda, the mother of T’Challa'’ half-sister (and a Black Panther in her own right) Shuri. In his role as king, T’Challa has relied on his uncle S’Yan who filled the role of Black Panther before him, as well as his second-in-command W’Kabi and longtime bodyguard Zuri. T’Challa and Ororo Munroe were married for an all-too-brief period of time.\n\nIn the Super Hero community, T’Challa worked as a member of the Avengers, the Ultimates, and the Crew. He has close relationships with Luke Cage, Falcon, Monica Lynne, and Brother Voodoo, and has also worked with Blade. Captain America personally recommended T’Challa for Avengers membership after meeting him for the first time. T’Challa and Iron Man’s relationship can be described as rocky, but ultimately respectful. T’Challa also befriended government employee Everett K. Ross during his extended stay in the United States.\n\nHEIGHT\n\n6'\n\nWEIGHT\n\n200 lbs.\n\nGENDER\n\nMale\n\nEYES\n\nBrown\n\nHAIR\n\nBlack\n\nUNIVERSE\n\nMarvel Universe\n\nOTHER ALIASES\n\nLuke Charles, Black Leopard, Nubian Prince, The Client, Coal Tiger\n\nEDUCATION\n\nPhD in physics\n\nPLACE OF ORIGIN\n\nWakanda\n\nIDENTITY\n\nPublicly known\n\nKNOWN RELATIVES\n\nN'Yami (mother), Romanda (stepmother), T'Chaka (father), Shuri (sister), Jakarra (half-brother, deceased), Hunter (adopted brother), Ororo Munroe (Storm, spouse), Khanata (cousin), Joshua Itobo (cousin), Ishanta (cousin), M'Koni Wheeler (cousin), T'Shan (cousin), Zuni (cousin)\n\nPOWERS\n\nHeightened SensesNight VisionHand-to-Hand CombatSuperhuman Strength\n\nGROUP AFFILIATION\n\nAvengers\nLeader, Teammate, King\n\nYears after taking on the mantle of the Black Panther and becoming a more established leader, T’Challa reached out to Marvel's First Family in FANTASTIC FOUR #52, marking his first-ever appearance. T’Challa brought the team to Wakanda and, after testing their mettle, asked them to help unravel the mystery of huge monsters attacking his people that turned out to be the work of Klaw.\n\nWith Klaw seemingly defeated, T’Challa thought about quitting the hero game, but stuck with it to help humanity as a whole. This soon led to his first meeting with Captain America, as the two teamed up to stop a man posing as Baron Zemo. Upon succeeding in that endeavor, Cap suggested that the Black Panther take his place with the Avengers.\n\nUnsure of these other masked heroes, T’Challa traveled to the United States and proved himself by saving his future teammates from the menace of Grim Reaper. His valor in the face of danger led to a quick and unanimous vote in favor of the Black Panther as an Avenger.\n\nDuring his first stint with the team, T’Challa not only helped save the world dozens of times but also established a secret identity as Harlem school teacher Luke Charles, allowing him to help the children he oversaw. Though he would soon come to know the Avengers as true friends and heroes, T’Challa later admitted that he initially joined the team to gauge the threat that they might pose to Wakanda.\n\nAfter the events of the Kree-Skrull War, the Panther allowed Professor X, Iron Man (Tony Stark), Mr. Fantastic, Doctor Strange, Black Bolt, and Namor to meet in Wakanda for a meeting of the minds that would become known as the Illuminati. T’Challa disapproved of their secretive methods and left the group, encouraging them to dissolve it, but would find himself in their ranks again years later.\n\nThough he would fully return to his duties in Wakanda, the Panther’s wanderlust would return again, sending him on a strange journey with the likes of Mr. Abner Little and Princess Zanda of Narobia, who was affiliated with the Collector. After a series of wild adventures all over the world, T’Challa returned home once again just in time to stop his Vibranium-poisoned half-brother General Jakkara from destroying the Great Mound.\n\nBlack Panther would spend the next several years leading Wakanda, while occasionally helping his fellow heroes in their various exploits. The murder of a woman who worked for a Wakanda-sponsored charity brought him to the United States, along with his honored bodyguards the Dora Milaje. They soon found themselves dealing with the evil Achebe, government liaison Everett K. Ross, and a variety of other conflicts stemming from the Panther's dual roles as leader and hero.\n\nA while later, T’Challa faced another challenge, one that even he didn't want to tackle right away: finding a queen. This search lead him directly to his childhood companion Ororo. After a courtship, the two wed in a ceremony that was blessed by the Panther God and witnessed by the Watcher. The duo remained together through some intense times in the world’s history, as the American Super Hero Civil War raged. Ultimately, they chose to defend Captain America’s side and even helped in his endeavors.\n\nWhile Reed and Sue Richards took some time away to repair their marriage (which nearly dissolved over the Registration), Black Panther and Storm took their spots on the Fantastic Four and moved the Wakandan embassy into the Baxter Building for a short time.\n\nNever away for long, the king and queen headed back home after Reed and Sue returned to their own team. T’Challa and his people stopped an attempted coup led by Eric Killmonger. The immediate future would hold even more problems for the Panther as he defended Wakanda from the Skrull Secret Invasion and then nearly perished in an attack perpetrated by Doctor Doom.\n\nWhile T’Challa healed, his sister Shuri took on the mantle of the Black Panther and led Wakanda. With the help of Shuri, Storm, the Dora Milaje, the Fantastic Four, War Machine, and Deadpool, T’Challa figured out a way to destroy the Vibranium sought by Doom, ending the conflict, but creating a variety of other challenges for his people. After this series of intense battles, T’Challa donned a stripped-down version of his costume and agreed to watch Hell's Kitchen for Daredevil, leaving Shuri to continue as the official Black Panther in Wakanda. During this time, he created a new secret identity as diner owner Mr. Okonkwo.\n\nMatt Murdock soon returned to reclaim his territory, which sent T’Challa back to Wakanda, where he reunited with his wife and sister, who continued her role as the Black Panther. However, a dream alerted T’Challa to a danger that required some assistance from Reed and Sue Richards. While Shuri, Storm, and Sue dealt with an influx of Anubis’ agents, T'Challa asked Reed to follow him into the Necropolis found underneath Wakanda. There the goddess Bast returned T’Challa to Black Panther status, but made him king of Wakanda’s dead, while Shuri would continue leading the living.\n\nBast also gave T’Challa a look at future events, which featured the Avengers battling the X-Men over control of Hope Summers, who absorbed part of the Phoenix Force along with Cyclops, Namor, Colossus, Emma Frost, and Magik. The Panther sided with his longtime team while Storm did the same with hers, putting them on opposing sides.\n\nThis matter proved difficult enough, but paled in comparison to the devastation a Phoenix-fueled Namor brought on Wakanda when he flooded the nation. As the battle reached its nadir, T'Challa informed Ororo that their marriage had been annulled and that the X-Men were no longer welcome in Wakanda.\n\nOne of the first people to spot the reality-threatening Incursions, Black Panther reassembled the Illuminati, this time with Beast standing in for the deceased Professor X, to figure out how to stop these alternate realities from crashing into theirs. During that time, relations with Namor deteriorated even further, especially after he left the Illuminati to work with the evil Cabal.\n\nAround this same time, Proxima Midnight of Thanos’ Black Order brought even more death and destruction to Wakanda. Shuri faced the threat head-on so her brother could carry on in his mission to stop the forces that nearly destroyed Wakanda from doing the same to the rest of the world.\n\nUltimately, T’Challa and the others failed to save their universe, leading to the Secret Wars and Battleworld. However, along with some fellow heroes, Black Panther made it into that new world in a life raft-like ship. On Battleworld, he once again worked with Namor to attain both the Siege Courageous and the Infinity Gauntlet.\n\nUpon returning to Wakanda, T’Challa found himself dealing with a number of homegrown conflicts including the Dora Milaje who decided to revolt, citizens of his nation who considered him too invested in the larger world, and other threats.\n\nThat did not stop him from co-creating a new initiative called the Ultimates that aimed to solve some of the biggest problems in the cosmos, like figuring out a way to sate Galactus’ hunger. He also formed the Crew to find out what happened to murdered civil rights activist Ezra Miller, along with Luke Cage, Storm Eden Fesi, and Misty Knight.\n\nAlways aiming to keep his people safe and give them everything the world—or even the galaxy—has to offer, T’Challa continues to struggle with his own demons, as well as external adversaries from ancient gods to dangerous mortals.\n\nNo matter what, the Black Panther will always step up to the challenge and figure out a dozen ways out of it before he wins the day."
  },
  {
    "id": "a1ca2d01-2492-439a-8ac8-d04a279159db",
    "name": "YON-ROGG",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/272sfc_ons_crd_02_0.jpg",
    "bio": ""
  },
  {
    "id": "0b46fcf2-5a25-4692-adce-5d6da49b1ca6",
    "name": "SPIDER-MAN",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/005smp_ons_crd_02.jpg",
    "bio": "PETER PARKER\nSPIDER-MAN\nBitten by a radioactive spider, Peter Parker’s arachnid abilities give him amazing powers he uses to help others, while his personal life continues to offer plenty of obstacles.\nOVERVIEW\nON SCREEN PROFILE\nON SCREEN FULL REPORT\nIN COMICS PROFILE\nIN COMICS FULL REPORT\n3\nDURABILITY\n1\nENERGY\n4\nFIGHTING SKILLS\n4\nINTELLIGENCE\n3\nSPEED\n4\nSTRENGTH\nBIOGRAPHY\nSPIDER-MAN\n\nWith spider-like abilities, science genius Peter Parker swings above it all as Spider-Man, costumed champion of the innocent who lives and fights with the wisdom of “With Great Power Comes Great Responsibility!”\n\nPuny Parker\n\nHigh school student and child prodigy Peter Parker submerged himself in his passion for science to avoid the taunts and threats of his fellow classmates and stumbled into a world beyond his imagining. While visiting a public exhibition of new breakthroughs in radiation manipulation and genetics, Parker felt the bite of a common house spider exposed to a particle beam and felt immediately ill from it, little realizing how much his life would change in the coming hours.\n\nOn the way home, the teenager unconsciously avoided a wayward automobile by making an incredible leap to the wall of a nearby building, finding himself miraculously able to stick to it by his hands and feet. Quickly realizing he had somehow acquired the abilities of a spider, he began testing his new-found powers and marveled at their width and breadth. Parker tested his spider abilities in the ring of a local wresting competition and, wearing a mask to hide his identity, easily bested the reigning champion.\n\nParker, an orphan, lived with his kindly Aunt May and Uncle Ben and was wary of exposing them to the public scrutiny that would surely ensue if he revealed his powers to the world, so he adopted a suitable costume and the name of “Spider-Man” to hide his true identity. He also designed and crafted two wrist-worn “web-shooters” to approximate a spider’s web-spinning capability, and with them swiftly became a smash television personality. Now with money to take care of his guardians and acclaim to salve puny Peter Parker’s wounds from classmates, the young man grew cold to everything but his media-darling career.\n\nEverything changed when, in an act of selfishness, Parker allowed a burglar to escape police arrest during a Spider-Man appearance rather than intervene. Later, when he returned home, he learned of his Uncle Ben’s murder at the hands of the very same burglar and instantly felt the weight of hubris upon his young shoulders. Vowing never to use his powers again for his own gain, he tracked down his uncle’s killer as Spider-Man and brought him to justice. From that moment on, he abandoned his media star persona and spun his web solely to capture criminals of all kinds.\n\nGreat Power\n\nLike his namesake, Spider-Man’s strength and agility stand far above those of the average human, allowing him to lift nearly ten tons and to leap and move at incredible speeds with high accuracy. He also heals faster than normal when injured, though he is not completely immune to viruses and other human ailments.\n\nAn inner “spider-sense” allows him a high degree of awareness to impending danger and to gauge not only its level of threat to him personally, but also the general direction of its approach. Combined with his unique fighting style, this grants Spider-Man an edge in his battles that often times defies logic.\n\nSpider-Man has designed and built many devices to aid him in his crime fighting, but the stand-out invention among these are his web-shooters. Strapped to both his wrists and activated by finger pressure applied to touch pads on his palms, the shooters can spray a unique fluid of the hero’s creation which solidifies to various thicknesses upon exposure to air and form into “webbing.” The tensile strength of the substance may be modified with each activation of the shooters, but at its peak can stop a large vehicle and also hold several persons for nearly two hours, after which, the webbing begins to dissolve.\n\nIn addition, Spider-Man carries small “spider tracers” that once placed upon a person or object transmit a specialized signal the hero may identify with his spider-sense and thus allow him to track to its origin point.\n\nTo Squash a Spider\n\nWith one of the most extensive and vile rogues gallery of any super hero, Spider-Man counts among his enemies and adversaries a collection of the world’s wickedest villains.\n\nMany of Spider-Man’s foes stand as normal humans with extraordinary ambition who adopted themes and gimmicks to elevate themselves above the simple man on the street. Wealthy Norman Osborn crossed swords with the young hero in the early days of Peter Parker’s costumed career and, decked out in his Green Goblin persona, taunted Spider-Man with his fearsome devices and hidden identity until his own mental instability drove him over the edge to his defeat. He returned time and time again, sometimes seemingly from death itself, to corrupt Parker’s life in every way imaginable, as either himself, or as a resurrected Green Goblin.\n\nOsborn’s clashes with Spider-Man stand out as some of the most challenging of the hero’s career, including replacing May Parker with an actress, framing Peter for murder, attempting to mold Spider-Man into his heir, a brief affair with Gwen Stacy, becoming the “top cop” of American law-enforcement, his rebranding as the Goblin King, and his continuing recollection of his hated foe’s secret identity.\n\nDuring the first time Spider-Man believed him dead, Osborn’s son Harry’s own mental issues led to him donning the Goblin gear and continuing his father’s horrific legacy. Other villains—most notably the Hobgoblin—have also patterned their villainous identities after the Green Goblin.\n\nDoctor Otto Octavius became the dreaded Doctor Octopus when an accident merged a set of mechanical, robotic limbs to the nuclear scientist’s body and accentuated his antisocial personality. Spider-Man battled the eight-limbed villain multiple times, and like the Green Goblin before him, Octavius cheated death on more than one occasion to bedevil the world—and his spidery adversary—anew. Octavius would go on to make a last-ditch attempt at prolonging his life by transferring his mind into Parker’s body to twist Spider-Man’s career into his own “superior” world-view.\n\nOne of the wallcrawler’s first enemies, the Chameleon, used his mastery of disguise and impersonation to make Spider-Man question the identity of everyone around him. Kraven the Hunter took big game hunting to evil extremes and turned Spider-Man’s very existence into a jungle of mystery and intrigue, not to mention immense danger. Kraven also replaced his foe for a short time, but lost his own life at the end of the twisted trail.\n\nNot all of Spider-Man’s enemies hail from this planet. The threat of Venom began when an alien parasite arrived on Earth as a replacement costume found on a far-off world by Spider-Man. The “symbiote” bided its time to subvert Spider-Man into a permanent host, but when Peter fought off its influence, it moved onto other humans to play out its violent desires, even to the point of splitting off parts of itself to create new menaces, most notably the murderous Carnage.\n\nOther formidable foes Spider-Man has faced over the years include memorable threats like the Vulture, Electro, Sandman, Rhino, Scorpion, Kingpin, Shocker, and the Lizard. While Spider-Man has managed to fend them off numerous times, they’ve all been notably resilient, returning to fight him time after time.\n\nThe Web of Family\n\nStrong ties to family and friends have seen Spider-Man through his ongoing trials and tribulations and provided him with a lifeline when things seemed darkest.\n\nThe presence of Parker’s aunt, May Parker, in his life cannot be understated for its importance. Raising her nephew as her own after the death of his parents provided him with a foundation of love and wisdom that he carries with him to this day. May’s advanced years and shaky health brought turmoil to Parker’s young life, but also drove him to strive for success and often times gave him something to fight on for. Most importantly, together the two survived the murder of May’s husband Ben, and their relationship strengthened because of it.\n\nParker’s college girlfriend, Gwen Stacy, also acted as a catalyst in his life. Peter and Gwen had a turbulent relationship – much of it do to his secret identity as Spider-Man, which she never learned the truth about – but they also had a close bond and Peter envisioned his future with her. Her death at the hands of the Green Goblin impacted him severely, but reminded him of the sanctity of life and how easily it may slip away.\n\nPeter grew closer to his good friend Mary Jane Watson following Gwen’s death, and the friendship eventually blossomed into a romance. The two married, but after a time of happiness balanced with tragedy, the Parker’s marriage was wiped from history by the demonic figure Mephisto, who offered to spare the life of a dying May Parker in exchange for Peter and Mary Jane’s nuptials. However, the young woman remains his good friend and strong ally when Spider-Man needs her most.\n\nIn the super hero community, the webslinger counts Johnny Storm, the Fantastic Four’s Human Torch, as one of his best friends and frequent foil. The two heroes have shared many adventures and their well-known bickering and insults hide a deep mutual respect and camaraderie. While often dismissed as an annoyance by other costumed heroes, Spider-Man’s alliance with the Avengers at various times in his career sometimes elevates him in the eyes of his fellow champions.\n\nWhile perhaps far from a friend, J. Jonah Jameson, publisher of New York’s Daily Bugle newspaper, also exists as a prominent figure in Parker’s life. The young man acted as photographer for the Bugle for several years, feeding shots of Spider-Man in action to Jameson, but also providing fuel for the man’s fire in his campaign to rid the city of the wallcrawler’s “menace.” He, too, grew to respect Parker as a person, though his cantankerous attitude would usually serve to drive his employee out of his office more often than not.\n\nOther important figures in Parker’s day-to-day life include former high school bully turned close friend Flash Thompson, Jameson’s right-hand man at the Bugle—and staunch supporter of Parker—Robbie Robertson, hard-hitting investigative reporter Ben Urich, and fellow Spider-Man and eager high school student Miles Morales. Parker met the latter on a sojourn to a parallel Earth, one that has since been wiped from existence but left Morales on Parker’s Earth to continue his costumed career as he learns the ropes from other costumed champions, chief among them the original Spider-Man.\n\nHEIGHT\n\n5'10\"\n\nWEIGHT\n\n167 lbs.\n\nGENDER\n\nMale\n\nEYES\n\nHazel\n\nHAIR\n\nBrown\n\nUNIVERSE\n\nMarvel Universe\n\nOTHER ALIASES\n\nPeter Benjamin Parker, Friendly Neighborhood Spider-Man, The Amazing Spider-Man, The Sensational Spider-Man, The Spectacular Spider-Man, Tiger, Spidey, Webhead, Webslinger, Wall-crawler, Little Man, (formerly) The Amazing Octo-Spidey, Bag-Man, Bookworm, Captain Universe, Dusk, Hornet, Mad Dog #336, Man-Spider, Prodigy, Puny Parker, Ricochet, Scarlet Spider, Spider-Hulk, Spider-Phoenix\n\nEDUCATION\n\nBS in Physics, doctoral studies in Biochemistry at ESU (Empire State University) (incomplete)\n\nPLACE OF ORIGIN\n\nForest Hills, New York\n\nIDENTITY\n\nSecret\n\nKNOWN RELATIVES\n\nMary Parker (mother, deceased), Richard Parker (father, deceased), Teresa Parker/Teresa Durand (Earth-18119, sister), Mary Jane Watson-Parker (Spinneret, Earth-18119, wife), Anna-May \"Annie\" Parker (Spiderling, daughter), Aunt May (May Parker/May Parker-Jameson, aunt), Uncle Ben (Ben Parker, uncle, deceased), J. Jonah Jameson Sr. (step-uncle, deceased), Ben & May Parker’s unborn child (cousin, deceased), Peter and Ann Parker (grandparents, deceased), Will Fitzpatrick (grandfather, deceased), Ben Reilly (clone, deceased), Kaine (clone), other clones (deceased), April Reilly, Jan Reilly, Sam & Diane Reilly, Roger Reilly, Harold Reilly, Julia, Amanda, Amy, Alexa (last names unrevealed), relatives via extended family\n\nPOWERS\n\nSuperhuman StrengthSuperhuman SpeedSuperhuman ReflexesSuperhuman DurabilityHealing Factor\"Spider-Sense\" AlertHeightened SensesWallcrawling\n\nGROUP AFFILIATION\n\nFrightful Four\nAlong Came a Spider\n\nThroughout his high school years, Peter Parker earned enemies and allies alike while he established Spider-Man as a wise-cracking, smart-aleck super hero, everything he was not as himself. As his costumed career progressed, his adventures grew stranger and more intense.\n\nAfter graduating from Midtown High, Parker’s romance with Gwen Stacy became a big part of his life. A fellow science major at Empire State University, Gwen dated Parker’s friend Harry Osborn after Peter initially rebuffed the girl during a time when May Parker was in the hospital, but the two eventually found each. It seemed to be the love story of a liftetime, but when tragedy struck in the form of Gwen’s father, Captain Stacy, being killed in the middle of a battle between Spider-Man and Doctor Octopus, Gwen placed all the blame on the webslinger. Not long after, Gwen herself died as a result of the Green Goblin’s hatred for Peter Parker, whom he’d discovered was secretly Spider-Man.\n\nLife continued for Parker. He attended Empire State University, fought his best friend Harry Osborn as a new Green Goblin, clashed with a clone of himself created by one of his professors -- who posed as a criminal called the Jackal -- and finally graduated from college. A new romance blossomed between Spider-Man and a thief known as the Black Cat, but she only had eyes for her “Spider,” not for Peter Parker. Then, in the middle of the everyday insanity, the wallcrawler found himself kidnapped, along with many of Earth’s other heroes, to fight selected villains on a faraway planet. There, Spider-Man claimed a new costume from a strange device and returned to Earth with it.\n\nIn short order, the costume was revealed to be an alien parasite, a “symbiote,” that attempted to attach itself permanently to Parker, but the young hero discovered its weakness to sonic bombardment and divested himself of it. It later bonded with another human and transformed into Venom, one of Spider-Man’s most horrific adversaries. Meanwhile, Parker’s bond with Mary Jane Watson strengthened through hard times and he proposed to her. MJ admitted her knowledge of his Spider-Man identity, and the two were wed, but shortly thereafter, the webslinger’s old enemy Kraven waylaid Spider-Man, buried him alive, and took his place until Parker managed to throw off the death-like state he’d been placed in and take his life back.\n\nSpider-Man became an on-call Avengers reservist, at first believing himself too busy with his own life to be a full-time member, but later accepting a formal place on more than one Avengers team and even financing the group for a brief time. An off-shoot of Venom became a menace dubbed Carnage, who rampaged on several occasions and proved himself even more violent and unpredictable than his “father.” As a married couple, the Parkers muddled through ups and downs, including Mary Jane’s revival of her modeling career and a dark time when her husband believed she’d died in a fiery plane explosion.\n\nAlso thought to be dead by Parker, the Jackal’s original clone returned as “Ben Reilly” and took on a costumed career of his own as the Scarlet Spider. This was until Parker believed his days as Spider-Man were over and Reilly accepted the mantle for a brief time, which eventually ended in his supposed death. With renewed vigor, the original wallcrawler made a comeback in the face of new and old challenges, including adopting four new super hero personas upon being accused of murder, the return of Norman Osborn, separation from Mary Jane, learning his Aunt May knew his secret identity, enhanced powers, and full Avengers membership.\n\nA stranger named Ezekiel approached Parker to inform him that his spider powers were also mystical in nature, not just science-based, and that as the spider “totem” of his reality, he’d attract the attention of a totlem-hunter called Morlun. The interdimensional being nearly defeated Spider-Man for good, but the webslinger deduced a way to defeat Morlun, though he’d later return to spread further chaos. Whether Ezekiel’s declaration of Parker’s abilities has any basis in fact is still unclear.\n\nAvengers status would also come with a downside for Spider-Man. A so-called “Civil War” between Captain America and Iron Man, after the Superhuman Registration Act passed in the United States, led Parker to reveal his identity on national television, shocking the nation and those closest to him who never knew his secret. To make matters far worse, May Parker was gravely wounded from being shot, and as she lay dying, the demonic Mephisto visited the Parkers and made them an offer: May’s life for Peter and Mary Jane’s marriage. After deep debate, the couple accepted the deal and their wedded union was undone. To all but Peter and Mary Jane, their wedding never occurred and Parker never revealed his identity to the world, and they returned to their separate, individual lives.\n\nNorman Osborn’s machinations after the Super Hero Civil War and an alien Skrull invasion catapulted him to the position of “top cop” in the country and his twisted version of federal law enforcement. Spider-Man and his fellow heroes brought him down eventually, but not without several battles against Osborn’s forces. Later, a dying Doctor Octopus manipulated Parker into a position for the evil genius to switch minds with his enemy, thus granting him Spider-Man’s youthful power and Parker a swift death in a decrepit frame. Octopus became a “superior” Spider-Man for a time, but Parker’s spirit lived on within his mind and fought for dominance once more, ultimately triumphing over his foe. Around this time, the revelation of multiple other Spider-Man-type heroes from parallel universe occurred. This “Spider-Verse” encompasses both male and female versions of the wallcrawler, as well as animal incarnations.\n\nPeter Parker, the perennial loser and penny-pincher, developed not only his own worldwide Fortune 500 industry, but also a respectable fortune. This lasted until the notorious “Parker Luck” kicked in. After a series of unfortunate events, he lost his business and his wealth, and returned to his former hand-to-mouth existence."
  },
  {
    "id": "fa6216b3-2e7a-45a9-94c7-a09b8e45342f",
    "name": "GOOSE THE CAT",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/247gse_ons_crd_01.jpg",
    "bio": ""
  },
  {
    "id": "5c8b0b1b-4f77-492c-82f4-d3b0141a6118",
    "name": "IRON MAN",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/002irm_ons_crd_03.jpg",
    "bio": "TONY STARK\nIRON MAN\nGenius. Billionaire. Philanthropist. Tony Stark's confidence is only matched by his high-flying abilities as the hero called Iron Man.\nOVERVIEW\nON SCREEN PROFILE\nON SCREEN FULL REPORT\nIN COMICS PROFILE\nIN COMICS FULL REPORT\n6\nDURABILITY\n6\nENERGY\n4\nFIGHTING SKILLS\n6\nINTELLIGENCE\n5\nSPEED\n6\nSTRENGTH\nBIOGRAPHY\nCOOL EXEC, HEART OF STEEL\n\nTony Stark is the wealthy son of industrialist and weapons manufacturer Howard Stark and his wife, Maria. Tony grew up a genius with a brilliant mind for technology and inventions and, naturally, followed in his father’s footsteps, inheriting Stark Industries upon his parents’ untimely death. Tony designed many weapons of war for Stark Industries, far beyond what any other company was creating, while living the lifestyle of a bon vivant.\n\nFate would take a dark turn for Tony Stark once he decided to consult on a weapons contract overseas in enemy terrain. An improvised explosive device exploded underneath Tony’s transport, and he was brought to the brink of death.\n\nAwakening as a prisoner of the warlord Wong-Chu, Tony made a gruesome discovery: the explosion had sent a piece of shrapnel mere inches from his heart. It was only the timely intervention of fellow captive and engineer Yinsen that kept the shrapnel at bay.While held captive, and forced to work on weapons, Tony turned his near-death experience into inspiration. What if he could power an iron suit that would not only keep the shrapnel from killing Tony, but also help him to escape?\n\nCombining their genius, Tony and Yinsen built a mighty suit of iron armor that would be dubbed Iron Man. This first suit left a lot of room for improvement, but it still did what Tony couldn’t do alone. Yinsen sacrificed his life so the final preparations could be made, and Tony, wearing the Iron Man suit for the first time, escaped and returned to the United States a changed man.With full access to his equipment, Tony built a new, more streamlined suit of armor—the first of many updated versions he would create—and dedicated his life to fighting threats to the world.\n\nIRON MAN\n\nSince that first suit built in a cave, Tony has created dozens of new suits and upgrades over the years. However, throughout the 50-plus Iron Man models, there are common offensive and defense capabilities found in most iterations.\n\nThe primary weapon contained within every suit, the repulsor rays use energy pulses to repel and disrupt enemies and are generated through the suit’s gauntlets. The suit’s booster jets enable Stark to fly fast enough to break the sound barrier, and maneuver more quickly than any fighter jet.\n\nIron Man’s helmet provides Tony with a heads-up display that gives him 360-degree vision, access to information about his surroundings and enemies, and the ability to transmit and block transmissions along any frequency. The helmet also gives Tony a degree of resistance to EMP and psychic-based attacks.\n\nA weapon centered in Iron Man’s chest, the unibeam is capable of projecting dazzling light, and can also be used as a powerful force beam that is even more powerful than the repulsor ray.\n\nEach of Tony’s suits provides a full range of telecommunications, including the ability to jam and transmit on any frequency, and sophisticated artificial intelligence capable of piloting Tony to safety should he be rendered unconscious.\n\nBeyond his all-purpose suits, Tony has created specialized armor for specific scenarios. Some notable examples include the Hulkbuster armor (so-named as its size and strength allow Tony to stand toe-to-toe with the Hulk, when needed), along with deep-space, underwater and stealth suits.\n\nOne thing common to most of Iron Man’s recent suits is the integration of Extremis, an attempt to re-create the super-soldier serum with many modifications. When using Extremis, Tony can interface with his brain’s repair center, which allows him to rebuild his body from scratch. Essentially, Tony is able to merge his mind, body, and armor in unprecedented ways. He can “armor up” in mere seconds—with armor stored within himself—gains split-second reaction times, and can even generate new internal organs to replace the old. Unfortunately, Extremis is also vulnerable to being hacked, and the Skrulls and other organizations have done just that.\n\nREPULSING THE REPULSIVE\n\nNumerous villains have made up Iron Man’s gallery of enemies, with many of them similarly armor-based in order to counter Iron Man’s abilities. The Russians have created both the Crimson Dynamo and Titanium Man to try and stop the threat posed by Iron Man, and have fought Stark through numerous iterations.\n\nThe Mandarin is one of Iron Man’s fiercest archvillains. A tactical, mystical and technological genius, the Mandarin sought ultimate power, and often Iron Man is the only one smart and strong enough to stand in his way. In fact, the Mandarin, working with warlord Wong-Chu, captured Tony Stark and indirectly brought about the creation of Iron Man. The Mandarin has returned again and again to pit his magic and intellect against Stark technology.\n\nA competing industrialist, Obadiah Stane, never lost his taste for weapons and was a great fan of psychological warfare. He took hostile control of Tony Stark’s company for a time, and though he perished in battle, his descendants are perhaps even more ruthless than he was.\n\nAnother rival industrialist on par with Stane, Justin Hammer is interested in the accumulation of wealth and power and sees Tony’s altruism as a big stumbling block toward that goal.Other foes of note for Tony through the years have included the Ghost, Radioactive Man, and nefarious organizations like Advanced Idea Mechanics (AIM).\n\nFIGHTING AND SMITING\n\nIron Man can’t always fight alone and has many notable allies and teammates. Stark is one of the founding members of the Avengers and is considered one of the “Big Three” core members, along with Thor and Captain America. While he has left the team at various points for personal reasons, he has always returned to fight alongside them again and again. He is one Avenger that can always be counted on.\n\nOriginally, Tony’s secretary Pepper Potts and limousine driver Happy Hogan grew to be Tony’s two best friends in the world. A romance between Pepper and Tony fizzled out, but she and Happy found happiness together for a time, until his tragic death. More recently, Pepper has taken up occasional super heroics herself, with an armored suit Tony has created for her called Rescue.\n\nFormer military man James “Rhodey” Rhodes became Tony’s bodyguard and trusted confidant. When Tony’s alcoholism got the better of him, Rhodey became the new Iron Man. Later, Rhodey donned a weapons-laden variation on the Iron Man suit and dubbed himself War Machine, fighting alongside Tony many times.\n\nDuring a mind-clearing vacation from Earth, Tony joined the Guardians of the Galaxy, making fast friends with Rocket Raccoon especially. While Tony would eventually return to Earth, Rocket’s technology has made its way into many successive iterations of the Iron Man armor.\n\nHEIGHT\n\n6'1'', In Armor: 6'6''\n\nWEIGHT\n\n225 lbs., In Armor: 425 lbs.\n\nGENDER\n\nMale\n\nEYES\n\nBlue\n\nHAIR\n\nBlack\n\nUNIVERSE\n\nMarvel Universe\n\nOTHER ALIASES\n\nAnthony Edward \"Tony\" Stark, Shellhead, Golden Avenger, Tetsujin, Formerly Crimson Dynamo, Formerly Iron Knight, Formerly Hogan Potts, Formerly Randall Pierce, Formerly Spare Parts Man, Impersonated Cobalt Man (Ralph Roberts)\n\nEDUCATION\n\nPh.Ds in physics and electrical engineering\n\nPLACE OF ORIGIN\n\nLong Island, New York\n\nIDENTITY\n\nPublicly known\n\nKNOWN RELATIVES\n\nMaria Collins Carbonell Stark (mother, deceased), Howard Anthony Walter Stark (father, deceased), Morgan Stark (cousin), Edward Stark (uncle, deceased)\n\nPOWERS\n\nHeightened SensesSuperhuman StrengthRegenerationGenius Intelligence\n\nGROUP AFFILIATION\n\nAvengersS.H.I.E.L.D.\nAMAZING ARMOR, BLAZING POWER\n\nSince creating that first suit, Iron Man has gone through numerous events significant to his life.Originally, to cover for Tony Stark’s escapades as Iron Man, he convinced the world that Iron Man was his bodyguard. This helped explain the perceived close ties between Stark and Iron Man to both the outside world and even those who fought alongside Iron Man.\n\nIt was a brawl with the trickster god Loki that convinced Iron Man, the Wasp, Ant-Man, Thor and the Hulk to band together as a team. The Mighty Avengers stood tall, battling foes that no single one of them could face alone. Though the temperamental Hulk would leave straight away, Iron Man would become one of the Avengers’ core members, along with Thor and a newly revived Captain America.\n\nTony, working alongside Nick Fury, was also a key player in the buildup of S.H.I.E.L.D. from a tiny, secretive government branch to the well-equipped, global peacekeeping force it became. Though Tony and his chauffeur and best friend Happy Hogan both fell in love with secretary Pepper Potts, Tony, out of respect for his friend, agreed to step aside. Pepper and Happy were soon married, though their relationship would be a roller coaster.\n\nHaving faced near death more than once thanks to his injury, Tony underwent a heart transplant, and finally no longer relied on the Iron Man suit to live.\n\nTony’s dependence on alcohol was brought to a head when Iron Man failed in battle while under the influence. It was only the timely intervention of friends Bethany Cabe and Edwin Jarvis that Tony was able to keep his alcoholism at bay for a time. Alcoholism being what it is, though, is something Tony will have to manage for life. In fact, it wasn’t long after this that Tony relapsed, this time passing along his armor to Rhodey to become the new Iron Man until he was able to recover. This relapse also cost him his company, which he lost to his fiercest rival, the manipulative businessman Obadiah Stane.\n\nOn the road to recovery, but looking for a change in scenery, Tony moved to California. Back in the armor, he joined the newly formed West Coast Avengers. This newfound resolve led him to create a new company in Silicon Valley, called Stark Enterprises.\n\nSick of finding Stark technology among his enemies, Iron Man went about neutralizing all his technology among his armored foes. Unfortunately, many of these designs were used by S.H.I.E.L.D., who weren’t at all happy about their Mandroids and Guardsmen being shut down. Ultimately, Iron Man squared off against government operatives and temporarily faked his own death, something he would do more than once in his career.\n\nEventually, Tony discovered that the Iron Man suit was causing his nervous system to deteriorate. After briefly experimenting with a telepresence suit, Tony created the War Machine suit to protect himself. He again faked his death and put himself into suspended animation, passing the War Machine suit along to Rhodey, who continued in his stead.\n\nAfter Tony recovered, he seemingly went rogue, murdering several people and forcing the Avengers to recruit a teenage Tony Stark from the past to combat him. These events were later revealed to be manipulation by the time traveler known as Immortus, but in the interim, the adult Tony was killed.\n\nDuring a battle with Onslaught, the younger Iron Man was one of the many heroes, including his fellow Avengers, who were shunted into an alternate universe and believed dead. Eventually returning to his own reality, this younger Tony merged with a resurrected adult Tony thanks to Franklin Richards, who was in turn exonerated for previous charges. Stark then set up a new company called Stark Solutions and rejoined the Avengers.\n\nThe Iron Man armor technology became so sophisticated that it gained sentience and malevolence. While attempting to shut down this sentient armor, Tony Stark had a heart attack. The armor replaced Tony’s heart with an artificial one to save his life, and Tony began steering himself away from such high technology out of fears of this incident happening again.\n\nAfter Tony revealed his identity as Iron Man to the world at a press conference, the U.S. military determined it now had the ability to use Stark technology wherever it wanted. Tony managed to become Secretary of Defense, hoping to keep an eye on said technology.\n\nTony was forced to resign as Secretary of Defense due to manipulation by an insane Scarlet Witch, who brought about the destruction of Avengers Mansion and the temporary break-up of the Avengers. Soon after, Stark would join a gathering of heroes to stop a Super Villain prison breakout, leading to the formation of a new Avengers team who would use Stark Tower as their headquarters.\n\nDuring this period, Tony began using the Extremis serum to merge his mind, body and armor together in unprecedented ways.\n\nThe Avengers—and the Super Hero community at large—would face tremendous conflict when Tony faced off with longtime ally Captain America regarding the Superhuman Registration Act, siding with the government’s decision to regulate superheroes. The two ended up leading their own large factions of heroes, fighting for what they believed in, though Tony’s side eventually won the hard-fought conflict. In the wake of this Civil War, Stark would help convince Bucky Barnes to become the new Captain America after Steve Rogers was assassinated, while Tony himself became director of S.H.I.E.L.D.\n\nTony was unable to stop the Earth from being taken over by Skrulls, as the aliens bypassed Stark defense technology used around the world. He was forced to resign as S.H.I.E.L.D. director and the Avengers again temporarily disbanded, replaced for a time by a government-sanctioned team run by Norman Osborn.\n\nAs the Extremis serum began to fail in Tony’s body, causing his mind to deteriorate, he decided to erase all the information about Earth’s heroes gathered by the Superhuman Registration Act from the world’s computers, to stop it from falling into Norman Osborn’s hands. To restore Tony to his previous intelligence, his friends “rebooted” his mind, though doing so wiped out his memories of the Super Hero Civil War and the events that followed.\n\nTony created yet another new company, Stark Resilient, to provide free energy to the world. This enraged traditional industrialists like Justin Hammer. After Tony overcame mind control by a resurgent Mandarin, he decided to leave Earth for a time and join the Guardians of the Galaxy.Thanks to machinations by the Red Skull, many of Earth’s heroes and villains had their morality inverted. The now idealistically evil Tony Stark decided to sell the Extremis technology to the world, creating a utopia but leaving everyone dependent on him both physically and monetarily. It was only through a reboot of the universe during a second “Secret Wars” event that this malevolent Tony Stark was undone.\n\nOnce again, the world’s heroes came into great conflict with each other, this time over an Inhuman named Ulysses that could see crimes and other events before they happened. When the Avengers used this precognition to ambush Thanos, Rhodey was killed in the process, and Tony decided to make sure nobody used Ulysses’ abilities ever again.\n\nThis culminated in a battle between Iron Man and Captain Marvel. Tony lost and went into a coma. In his absence, an A.I. version of Tony assisted young genius Riri Williams in creating a new suit of armor, allowing her to fight as Ironheart in Tony’s absence."
  },
  {
    "id": "2408fbdf-d1c4-478f-9104-4839e9a723fe",
    "name": "CAPTAIN AMERICA",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/003cap_ons_crd_03.jpg",
    "bio": "STEVE ROGERS\nCAPTAIN AMERICA\nRecipient of the Super-Soldier serum, World War II hero Steve Rogers fights for American ideals as one of the world’s mightiest heroes and the leader of the Avengers.\nOVERVIEW\nON SCREEN PROFILE\nON SCREEN FULL REPORT\nIN COMICS PROFILE\nIN COMICS FULL REPORT\n3\nDURABILITY\n1\nENERGY\n6\nFIGHTING SKILLS\n3\nINTELLIGENCE\n2\nSPEED\n3\nSTRENGTH\nBIOGRAPHY\nCAPTAIN AMERICA\n\nFrom the dark days of world war to the explosive challenges of today, Super-Soldier Captain America stands ready as a shining sentinel of liberty to shield the oppressed and fight for freedom everywhere.\n\nNinety-Eight-Pound Weakling\n\nA poor orphan from the wrong side of the tracks in the days leading up to World War II, goodhearted Steve Rogers enlisted in the army to fight the Axis Powers, but met with rejection due to his small size and underdeveloped physique. Professor Abraham Erskine, a pioneer in the development of a Super-Soldier for the United States, saw potential in Rogers and whisked him into Project Rebirth, the professor’s bold experiment in enhancing the human body to its peak powers.\n\nRogers found himself subjected to Erskine’s treatments— a specialized serum and exposure to a unique form of radiation—and realized the professor’s dream, becoming the world’s first, fully developed Super-Soldier. Now muscular and tall, as well as possessed of amazing strength and agility, the former ninety-eight-pound weakling watched in horror as a Nazi spy shot and killed Erskine, and thereby ensured Rogers would be the last of his kind.\n\n \n\nThe United States government moved swiftly to fashion Rogers into a living symbol of inspiration to the public at home and soldiers abroad. And, after extensive combat training he debuted in a colorful, patriotic uniform as Captain America. Operating out of the army’s Camp Lehigh in Virginia, Rogers posed as an ordinary soldier, but conducted secret missions stateside and abroad as his alter-ego to smash spies, saboteurs, and the occasional Super Villain who threatened the country he loved so dearly. Soon, Cap captured the attention of the Red Skull, his evil counterpart in Germany, and the two formed a lasting enmity over the course of the war. The hero also gained a near-indestructible shield with which he became supremely efficient in both offense and defense.\n\nMore costumed champions began to appear and founded a fighting battalion known as the Invaders with Captain America. The Super-Soldier also struck up a close friendship with a young man named Bucky Barnes who was perceived as a kind of sidekick on Cap’s missions, though Bucky possessed his own formidable skills. Toward the end of the war, the famous fighting duo closed in on Baron Zemo, a Nazi scientist who’d committed nearly as many atrocities against the Allies as the Red Skull, and moved to destroy an experimental plane he coveted. Unfortunately, Cap and Bucky found themselves caught in the aircraft’s fiery demise while in flight, and both tumbled into the ocean, leading Cap to believe Bucky had perished in the explosion.\n\nDue to Erskine’s serum coursing through his veins, Cap’s body went into suspended animation once submerged in the frigid waters, and ended up encased in solid ice. In this manner, he slept away the decades until discovered by the Avengers, a team of Super Heroes, in modern times. Awakened and resuscitated, Cap’s astonishment in realizing he’d lost Bucky and everyone he’d ever cared for quickly gave way to his unshakable sense of duty and he once again donned his famous shield and outfit to join with the Avengers in their ongoing battle against injustice.\n\nPatriotic Power\n\nAfter being infused with the Super-Soldier serum, Steve Roger’s body reached the upper-most limits of human perfection in strength, stamina, agility, and durability. With training, he learned to use these traits in perfect unison in any given situation. Because of this, many see him as super human, but in truth he maintains a strict regimen of exercise to bolster the serum’s transformation of his physical form. In addition, Rogers’ charisma and shrewd decision-making ability are also recognized as being at the top-level of any human on Earth.\n\nAs Captain America, he carries a concave shield composed of vibranium and steel alloy. This makes the disc lightweight, nearly indestructible, and perfectly balanced. Cap’s extensive use of the shield in combat situations has formed a kind of symbiosis between the two, making the disc practically an extension of his will. Hurtling it with his enhanced strength and marksmanship, he can strike several opponents in quick succession and catch it on its return arc. The shield can also withstand extreme temperatures and pressure, as well as rebound most forms of energy directed at it.\n\nCap’s unique uniform is made of a tight-woven chainmail, able to deflect sharp objects and some smaller gauges of projectiles. He has also been seen wearing a belt equipped with pouches for quick access to a variety of useful items.\n\nCircle of Friends\n\nMany of Captain America’s friends and allies during World War II were lost to him due to the ravages of time during his suspended animation, and in the present day his closest companions are few in number.\n\nJames Buchanan “Bucky” Barnes survived the explosion of Baron Zemo’s plane to be snatched up by Russian operatives and brainwashed into an instrument of death, the Winter Soldier. Bucky eventually broke the deep conditioning to reaffirm a friendship with Steve Rogers that stretched back to the earliest days of the war, and today the two men think of themselves as brothers.\n\nWhen Cap met Sharon Carter, S.H.I.E.L.D.’s invaluable Agent 13, and learned she was the niece of his wartime flame Peggy Carter, the die was cast for them to become soulmates. Through thick and thin they’ve maintained their bond, even through tumultuous times like when Steve Roger’s temporary death came at the hands of a manipulated Sharon. Though the two may sometimes dream of a shared life together, their respective careers keep them from settling down as husband and wife.\n\nSam Wilson and Steve Rogers met under fire on a far-off island and became fast friends and later crimefighting partners when Cap helped Wilson create his Super Hero persona of the Falcon. Though both grew up on the mean city streets and share a common belief in justice and liberty, the two have more than once disagreed on matters of opinion, but have always reminded themselves of their friendship.\n\nAxis of Evil\n\nCaptain America toiled tirelessly to earn enemies throughout his career, but none so much as the Red Skull. The skull-faced villain charted his own course after his “creation” by Adolph Hitler himself, but he retained the Nazi mindset of superiority and world-dominance. Crafty and cunning, he waylaid Cap at every turn, even surviving into the modern age to bedevil his adversary time and time again. The Skull recognized Cap as his mortal enemy - perhaps not a genuine equal, but as someone whose image was to be corrupted, his goals subverted, and his life ruined. The Sentinel of Liberty never underestimated the Red Skull, and despite witnessing his supposed death many times, rarely believed his threat had truly ended.\n\nBaron Heinrich Zemo nearly rivaled the Red Skull in his battles with Captain America. Originally a Nazi scientist, Zemo’s diabolical inventions included a super adhesive to which he himself fell prey, leading to his mask becoming permanently adhered to his face. Zemo, like the Skull, survived the war to form the first Masters of Evil in the modern era, a group of Super Villains that opposed the Avengers and other heroes. Though Heinrich ultimately met his end, his twisted son Helmut picked up the Baron Zemo mantle and continued his father’s endless skirmishes with Cap.\n\nAnother purveyor of warped science from the World War II era, geneticist Arnim Zola created incredible beings to do his bidding, but battled Captain America many times to prove his mind was the superior. In recent years, Zola became the master of an entire other dimension apart from our own, one in which Cap led a revolt to disrupt the evil scientist’s mad dreams.\n\nOne other adversary rose up from the war era to follow Cap into the modern world: Baron Strucker. The evil aristocrat founded the organization which became known as Hydra, a global scheme to dominate the world through terrorism and subversion. Other hands have since replaced Strucker in the leadership of Hydra, but his dark legacy lives on.\n\nOther enemies of Captain America include the Red Skull’s right-hand lieutenant Crossbones, the Skull’s daughter Sin, the bizarre entity known as M.O.D.O.K., wayward psychiatrist Dr. Faustus, the acrobat Batroc, the anarchist Flag Smasher, and the snake-themed Super Villains who make up the dreaded Serpent Society.\n\nHEIGHT\n\n6'2''\n\nWEIGHT\n\n240 lbs.\n\nGENDER\n\nMale\n\nEYES\n\nBlue\n\nHAIR\n\nBlond\n\nUNIVERSE\n\nMarvel Universe\n\nOTHER ALIASES\n\nSteven Rogers, Brett Hendrick, Buck Jones, Yeoman America, Nathan Hale, The Captain, Anthony Schwarz, Roger Grant, Steven Grant Rogers, Nomad, The Man Without a Country, Roger Stevens, Lord of the Frozen Ice, Blondie, The Living Legend, Granny, Cap, The Sentinel of LIberty, The Brooklyn Project\n\nEDUCATION\n\nHigh school graduate, one year of art school, military basic training, and private tutoring\n\nPLACE OF ORIGIN\n\nManhattan, New York City, New York\n\nIDENTITY\n\nPublicly known\n\nKNOWN RELATIVES\n\nSarah Rogers (mother, deceased), Joseph Rogers (father, deceased)\n\nPOWERS\n\nSuperhuman AgilitySuperhuman StaminaSuperhuman DurabilitySuperhuman ReflexesSuperhuman Strength\n\nGROUP AFFILIATION\n\nAvengersSecret Avengers\nShield Stories\n\nCaptain America’s adventures in modern times kicked off with several missions with the Avengers that culminated in him taking over the leadership role when the founding members stepped back to address their individual lives and careers. Cap reorganized the team as a small fighting band consisting of outlaws Hawkeye, Quicksilver and the Scarlet Witch, which the press dubbed “Cap’s Kooky Quartet.” He made it work somehow until the original members came back to once again fill the ranks.\n\nS.H.I.E.L.D. director Nick Fury, whom Cap knew during World War II, approached the hero with an offer to join the spy organization, and through several missions for them Cap faced various menaces and met Agent 13, Sharon Carter. The Red Skull returned, having secured a Cosmic Cube, a device granting its user near-unlimited power, but Cap smashed the villain’s plans. Later, after his civilian identity as Steve Rogers was publicly revealed, he worked to train an eager young teenager named Rick Jones as his new partner, all the while mourning Bucky.\n\nThe Falcon grew into the role of Cap’s partner when Rick and the hero grew apart, and Cap became a police officer in his civilian life. He returned to the Avengers after a brief hiatus from membership when the team faced the galactic menace of two powerful alien races battling each other in the Kree-Skrull War. Around this time, Cap also addressed the appearance of the man who posed as Captain America while the real deal slept away the decades. Later, Helmut Zemo, the son of the original Baron Zemo, rose up to claim his father’s legacy and continue his evil.\n\nWhen the Secret Empire, another subversive group, made a play to take over the United States, Cap disrupted their gambit, but was crestfallen when he discovered the true identity of the Empire’s masked leader to be a high-ranking government official. His faith in his country shaken to the core, he abandoned the role of Captain America to temporarily adventure as Nomad until circumstances drove him to once again take up the shield and the old red, white, and blue. As Cap again, he and the Falcon strengthened their partnership to face the Madbomb crisis as well as the rise of Arnim Zola as a mad geneticist.\n\nFollowing a string of violent clashes, the Red Skull accelerated Cap’s physical body to match his true age, and the two entered into what the Skull believed would be their final battle. In the end, Cap believed his greatest enemy to be dead. Later, the Serpent Society crawled into the light to challenge the hero, and Cap set up a national “hotline” to answer calls for help across the country. Back in New York, Zemo and the latest edition of the Masters of Evil invaded Avengers Mansion, captured Cap, and destroyed precious mementoes of his before his eyes.\n\nThe U.S. government removed Rogers from the Cap role, forcing him to rebrand himself as “The Captain,” so he could continue his crusading career. When he returned to the shield, his replacement, John Walker, became a new government operative called the USAgent. Strange times followed, including a romance with a former Serpent Society member, a transformation into a werewolf, and a breakdown of the Super-Soldier serum in his blood that forced Cap to don armor and eventually led to his disappearance, perhaps to die alone.\n\nRogers was revived in time to take up the shield against a resurrected Red Skull and a new threat involving the Cosmic Cube. Once again stripped of his Cap role not long after, he operated as an “ex-patriot” until returning to his old uniform. For a brief time following that, Cap found himself submerged in a new reality apart from his own, wherein he operated as a somewhat different Captain America, until brought back to his proper existence. Soon after, Cap would lose his shield at the bottom of the ocean and be forced to use makeshift replacements. Luckily, the real shield was recovered and returned to its rightful owner.\n\nOne of the Avengers’ greatest foes, the time-traveling Kang, invaded Earth with an immense army, but the assembled heroes fought back and Cap himself faced Kang in personal combat and defeated him. The Red Skull later worked secretly as Dell Rusk, the U.S. Secretary of Defense, until exposed by Cap, while the Scarlet Witch, one of the original “Kooky Quartet” members went mad and attempted to obliterate the Avengers. In the days that followed, Bucky resurfaced alive as the Winter Soldier, a brainwashed Russian assassin, and Cap helped a small group of teenage heroes form the Young Avengers out of the ashes of Scarlet Witch’s assault.\n\nWhen Cap’s teammate Iron Man proposed and pushed through into law a Superhuman Registration Act, Cap vocally disagreed with it and a period of “Civil War” erupted between the two old friends. Spreading to the entire Super Hero community, the skirmishes escalated until Rogers realized the toll it was taking on the public and surrendered to the authorities. Incarcerated, he fell to an assassination attempt concocted by the Red Skull, which used a duped Sharon Carter as the instrument of death.\n\nSteve Rogers’ essence wandered through time, reliving moments throughout his career as Cap, but was brought back to the present to be rejoined with his body, although not without a battle with the Red Skull for possession of it. While believed dead, Cap’s mantle was taken up by Bucky and Rogers insisted his old partner maintain the role while he himself became the director of S.H.I.E.L.D. for a time. As always, he returned as Captain America when the world and the heroic community needed him most, during a siege on the fabled realm of Asgard. Unfortunately, Cap’s shield was later broken in the midst of another crisis involving godlike beings, but was repaired, albeit with a scar to remind its user of the high price of being a champion.\n\nCap organized an Avengers Unity Squad to bring together humans and mutants for the greater good and one of their first challenges involved a Red Skull clone who stole the brain of the late Professor X, a powerful mutant with psychic abilities. Once again, the Super-Soldier serum was neutralized in Cap’s blood, causing him to outwardly transform into nearly his true advanced physical age. The Falcon became Captain America during this time, until a sentient Cosmic Cube known as Kobik restored Rogers to his heroic stature, but also to a warped mindset manipulated by the Red Skull in which Cap was raised as an agent of Hydra, bent on subjugating the world to the group’s twisted domination ideals.\n\nThe true Steve Rogers resurfaced when given a body by Kobik and the Hydra version was defeated, and Captain America headed out to travel the United States in search of not only himself, but the real America he loves so much."
  },
  {
    "id": "82fb3882-69d5-4b39-84f5-91628a670814",
    "name": "BLACK WIDOW",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/011blw_ons_crd_03.jpg",
    "bio": ""
  },
  {
    "id": "79c1b663-d4a3-4476-ab6a-600eabaecf20",
    "name": "HULK",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/006hbb_ons_crd_03.jpg",
    "bio": "BRUCE BANNER\nHULK\nDr. Bruce Banner lives a life caught between the soft-spoken scientist he’s always been and the uncontrollable green monster powered by his rage.\nOVERVIEW\nON SCREEN PROFILE\nON SCREEN FULL REPORT\nIN COMICS PROFILE\nIN COMICS FULL REPORT\nBIOGRAPHY\n\nScientist Bruce Banner’s inner turmoil transforms him into the mean, green rage machine called the Hulk.\n\nThe Monster Inside\n\nThe child of an abusive father, Bruce Banner grew up shy and introverted, yet a scientific genius. As a young man, thanks to his standout work in the field of nuclear physics, he attracted the attention of the U.S. Army who wanted to adapt his theories for weaponry. Banner resisted such notions, but failed attempts at landing steady work convinced him to accept a position at a federal nuclear research facility at a missile base in the New Mexico desert.\n\nAt the base, Banner was befriended by Betty Ross, daughter of General Thaddeus “Thunderbolt” Ross, a man who took an instant disliking to the diminutive, passive scientist. While at the base, Banner began to develop and build a bomb that utilized a high concentration of gamma radiation, a project of high interest to an undercover foreign agent stationed there. When a teenager named Rick Jones wandered onto the test field just as Banner started the countdown for the gamma bomb’s initial test detonation, the scientist rushed out to the area to warn Jones, but the foreign agent purposefully continued the test. The bomb exploded, bathing Bruce Banner in its radiation.\n\nIncredibly, he survived the detonation, but later in the evening transformed into a large, grey, man-like monstrosity dubbed a “hulk” by one of the base’s soldiers.\n\nOnly Rick Jones witnessed the transformation, and perhaps out of a feeling of guilt over Banner’s exposure to the gamma rays shepherded the creature to a place of safety until it changed back into the scientist. Once realizing what had occurred, Banner accepted Jones’ help and began to work on a cure for his incredible situation in secret, but the Hulk—now with green skin, rather than grey—continued to emerge and quickly earned the enmity of General Ross.\n\nHulk-Out\n\nBruce Banner’s intelligence has made him one of the world’s leading authorities on nuclear physics, as well as other related disciplines, but these qualities become submerged normally upon his transformation into the monstrous Hulk, who exists as a physical extension of his pent-up rage and mental imbalance.\n\nThe Hulk’s strength remains at the top level of all super human beings on Earth and increases exponentially as his anger grows. This strength grants him not only upper body prowess, but also the ability to leap great distances and land without harm to himself. The Hulk’s skin is nearly impenetrable and his lung capacity allows for long periods of submersion in water, exposure to many forms of gases, and even to temporary survival in the airless vacuum of outer space.\n\nBanner’s transformations are usually triggered by adrenaline rushes when he becomes anxious, nervous, or angry, which lead to similar feelings in the Hulk. Normally, the scientist’s personality and intelligence give way to his alter-ego’s brutish mindset, creating what appears to be two different personas who seem to share only the singular desire to be left alone.\n\nFriends of the Monster\n\nPerhaps ironically, the Hulk has arguably made more friends and allies than Bruce Banner, some of them have even grown close to him and formed lasting bonds.\n\nBetty Ross saw something in Bruce Banner from the moment they met at the New Mexico missile base and, despite her father’s objections, tried to understand the shy scientist. The Hulk noticed Betty early in his existence, most likely due to Banner’s own interest in the young woman, and after she learned of their dual identity, she began to sympathize with their plight. Bruce and Betty eventually married, but their happiness was short-lived due to the tribulations of the Hulk, leading to a rocky road for their relationship.\n\nRick Jones’ presence at the missile base during Banner’s test of his gamma bomb may have paved the way to the creation of the Hulk, but the young man has more than made amends for it with his long friendship with both the scientist and the Hulk. In fact, in the early days of their bond, Jones became the only person who could calm the raging creature and help him return to Banner’s form. Jones came and went over the years following, owing to his own tumultuous life, but he somehow always gravitated back to the Hulk’s side to provide support and partnership.\n\nIn more recent times, boy genius Amadeus Cho has filled the role once played by Rick Jones, that of the Hulk’s companion and confidant. Cho stood with the beast through many hardships, and even became a Hulk himself after Banner’s apparent demise.\n\nAmong the super human community, the Fantastic Four’s Ben Grimm, aka the Thing, and the X-Men’s Wolverine not only have battled the Hulk on numerous occasions, but also formed odd friendships with him, perhaps due to their own sense of isolation as oddities.\n\nHatred for the Hulk\n\nThe Hulk’s frightening appearance, his destructive tendencies, and his defiance of being caged and studied has resulted in a long list of opponents and enemies throughout his time roaming the planet.\n\nArguably his first enemy was “Thunderbolt” Ross, who made it his own personal crusade to track down, capture, and destroy the Hulk. This mission played out over many years in a cat-and-mouse game between the general, Bruce Banner, and his green alter-ego, to the point of many battles and wasted tax dollars in weaponry and equipment on Ross’ part. On an even more personal level, Ross could never understand or accept his daughter Betty’s love for the scientist and sympathy for his plight, leading to many clashes between the two over the years. Ironically, General Ross eventually became a Hulk, too, at a time when Banner’s own creature was nowhere to be seen.\n\nGamma radiation played a major role in the creation of two of the Hulk’s greatest opponents, the Leader and the Abomination, with the latter gaining heightened intelligence from the unique radiation, and the former transforming into a grotesque monster even more terrifying than the Hulk. The Leader proved the more persistent of the two foes, building scheme upon scheme to waylay and destroy his fellow gamma-spawned nemesis, even to the point of attempting to take over the Hulk’s body when his own was mortally damaged.\n\nOther recurring foes of the green giant include a possible future version of the Hulk known as the Maestro, the powerful Agamemnon and Achilles of the secretive Pantheon, the criminal U-Foes, and the gadget-laden Boomerang.\n\nHEIGHT\n\nBruce Banner: 5'9'', Hulk: 7'6''\n\nWEIGHT\n\nBruce Banner: 128 lbs., Hulk: 1150 lbs.\n\nGENDER\n\nMale\n\nEYES\n\nBruce Banner: brown, Hulk: green\n\nHAIR\n\nBruce Banner: brown, Hulk: green\n\nUNIVERSE\n\nMarvel Universe\n\nOTHER ALIASES\n\nRobert Bruce Banner, Breaker of Worlds, Patient #133, Green King, Green Scar, Holku, Sakaarson, Green One, Eye of Rage, World Breaker, Harkanon, Haarg, Once-Savage, Two-Minds, Captain Universe, Professor, War, Maestro, Joe Fixit, Mr. Fixit, Annihilator, Mechano, Bruce Barnes, Bruce Smith, Glenn Summers, Ross Oppenheimer, Fred Pottsworth, Bob Danner, Bruce Ross, Bruce Jones, Bruce Roberts, Mr. Bergen, Bruce Franklin, Bruce Green, Bruce Bancroft, Bruce Baxter, Bruce Davidson, David Bannon, Robert Baker, Bruce Bixby, David Banner, David Bixby, Two-Hands, Greenskin, Mr. Green, Jade Jaws, Green Goliath, Jade Giant, Gray Goliath, Mighty Bob, Anti-Hulk, Friday, Green Golem, Golem\n\nEDUCATION\n\nPh.D in nuclear physics and two other fields\n\nPLACE OF ORIGIN\n\nDayton, Ohio\n\nIDENTITY\n\nPublicly known\n\nKNOWN RELATIVES\n\nRebecca Banner (mother, deceased), Brian Banner (father, deceased), Caiera (spouse, deceased), Elizabeth \"Betty\" Ross (spouse, deceased), Skaar (son), Jennifer Walters (She-Hulk, cousin), Elaine Banner Walters (aunt, deceased), Susan Elizabeth Banner (formerly Susan Drake, aunt, possibly deceased), William Morris Walters (uncle)\n\nPOWERS\n\nHealing FactorSuperhuman DurabilitySuperhuman StrengthSize and Shape AlterationGenius Intelligence\n\nGROUP AFFILIATION\n\nAvengersDefenders\nWay of the Wandering Warrior\n\nWhile avoiding General Ross and the U.S. Army, the Hulk took on extra-normal opponents such as the wily Gargoyle and the subterranean Tyrannus as his transformations back and forth to Bruce Banner became less erratic and more stabilized. Eventually, the change into a now-green form would usually occur mostly due to Banner’s adrenaline rushes, something the worried scientist worked desperately to control while he hid his secret from the world.\n\nWhen the Asgardian god of mischief Loki sought to sow chaos for his half-brother Thor, he manipulated Hulk into a clash with Thor, Iron Man, Ant-Man, and the Wasp, though he only succeeded in the inadvertent creation of a new team of heroes, the Avengers. Suspicious of his teammates, the Hulk left very shortly after the team formed, and soon began an alliance with Namor the Sub-Mariner to oppose the Avengers. When that too fell apart, the green behemoth returned to his wanderings and infrequent battles with General Ross’ “Hulkbusters” fighting unit.\n\nBelieving he operated in Banner’s best interests, Rick Jones revealed the scientist’s secret to Ross and his daughter Betty, and before long the public knew the truth of the connection between Banner and the Hulk. Banner subsequently proposed to Betty, but the Hulk came between them and the young woman went on to marry Bruce Talbot, one of her father’s army majors and a steadfast rival of Banner’s. The Hulk helped the mystic Dr. Strange and Namor defeat an otherworldly threat to the Earth and joined Strange’s loose “non-team” the Defenders for many adventures in the years to come alongside various teammates.\n\nAt one point, the Hulk was transported to another plane of existence, where he met the beautiful queen Jarella and fell in love with her. Then, back on Earth, Banner performed a blood transfusion on his wounded cousin Jennifer Walters, which caused her to change into a “She-Hulk,” and later Banner accepted the Hulk as an integral part of himself. When an accident allowed the Hulk to retain his alter-ego’s intelligence, the U.S. president pardoned the creature, until Banner once again lost control of his other self. Wandering once more, and near-mindless, the Hulk found himself at an other-dimensional crossroads, the result of Dr. Strange’s well-meaning spells, and entered into a new series of weird adventures there.\n\nBrought back to Earth accidentally by the Canadian super team Alpha Flight, the Hulk rampaged across the land before being separated into two wholly separate beings, himself and Bruce Banner. Believing a new future lay ahead of him, the scientist proposed again to the now-divorced Betty Ross, but their hopeful new wedded life fell quickly into chaos when the Hulk and Banner were reintegrated. After that, a strange, intelligent, and grey-skinned version of the Hulk—not unlike his first form— emerged to work as an enforcer nicknamed Mr. Fixit in Las Vegas for a time.\n\nThe green Hulk eventually returned and due to the work of psychiatrist and fellow gamma-mutate Doc Samson, grew more intelligent. Now known as the Professor, this clever, smart Hulk met and joined the secretive group called the Pantheon, faced his own possible future-self, the Maestro, and reverted back to his more-brutish form when Banner received shrapnel close to his brain after an attack. The scientist also finally made peace with the ghost of his abusive father after the mutant Apocalypse removed a dangerous shard in his head and his beloved Betty seemingly died.\n\nA revived Betty came to Banner in the guise of the mysterious “Mr. Blue” to teach her husband self-hypnosis to help him control the inner Hulk. The Leader framed the green giant for murder, prompting Banner to hit the road and avoid the gamma villain’s bid to insert his own mind into the Hulk’s body. Another gamma bomb explosion temporarily resurrected the grey Hulk, and a collection of the smartest heroes on Earth called the Illuminati shot the Hulk into space for permanent exile, but a space warp transported him to the far-flung planet Sakaar where he became a popular warrior, and eventually the world’s ruler.\n\nLasting happiness on Sakaar eluded the Hulk when the power cell in his spaceship exploded and decimated a large portion of the planet, along with his queen. Returning to Earth for revenge on the Illuminati, the Hulk went on a rampage until Iron Man devised a way to transform the behemoth back into Bruce Banner and hold him in stasis. During this time, the Hulk was befriended by boy genius Amadeus Cho, and Banner witnessed the advent of both a new Red Hulk (secretly “Thunderbolt” Ross) and Rick Jones’ transformation into the blue beast called A-Bomb. The original Hulk finally returned to put all newcomers in their place, as well as to deal with the arrival of his son Skaar from Sakaar and Betty as a Red She-Hulk.\n\nDoctor Doom managed to separate Banner and his alter-ego once again, and the now-insane scientist sequestered himself on a remote island where he waged a private war on the Hulk. When the two were finally recombined, the Hulk joined the spy organization S.H.I.E.L.D. and after being healed of a head wound by Iron Man’s Extremis formula, manifested yet another new personality, Doc Green. Intelligent again, the Hulk decided to rid the world of all gamma-mutates—including his own cousin, She-Hulk—by taking back the radiation’s effects. However, when Amadeus Cho absorbed his own gamma-powers, the boy became the new Hulk.\n\nGuilt-ridden from all the hurt his alter-ego delivered to the world, Banner placed himself into seclusion until drawn from it by another “civil war” between Earth’s champions over an Inhuman with visions of the future. One such vision illustrated the Hulk’s eventual destruction of numerous heroes, but when Iron Man and others confronted Banner to take him into their custody, the archer Hawkeye subverted their intentions and killed the scientist with an arrow through his brain.\n\nLater, the nefarious Hand ninja clan stole Banner’s body to resurrect it for their own purposes, and mad bio-engineer Arnim Zola subsequently revived the Hulk for another temporary rampage during Hydra’s recent takeover of the United States.\n\n7\nDURABILITY\n5\nENERGY\n4\nFIGHTING SKILLS\n6\nINTELLIGENCE\n3\nSPEED\n7\nSTRENGTH"
  },
  {
    "id": "0a7a7c18-d364-4324-8df9-76723c4620ce",
    "name": "HAWKEYE",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/018hcb_ons_crd_02.jpg",
    "bio": "CLINT BARTON\nHAWKEYE\nA master marksman and longtime friend of the Black Widow, Clint Barton serves as the Avengers’ amazing archer.\nOVERVIEW\nON SCREEN PROFILE\nON SCREEN FULL REPORT\nIN COMICS PROFILE\nIN COMICS FULL REPORT\n2\nDURABILITY\n1\nENERGY\n4\nFIGHTING SKILLS\n2\nINTELLIGENCE\n2\nSPEED\n2\nSTRENGTH\nBIOGRAPHY\n\nEarth’s Mightiest Marksman, Clint Barton employs a devil-may-care attitude and mastery over one of civilization’s oldest weapons as the Avengers’ ace archer, Hawkeye. A mainstay of the hero team, Barton brings along an undying heroic spirit and the ability to hit any target.\n\nStringing the Bow\n\nOrphaned at an early age, Clint Barton and his brother Barney escaped an oppressive orphanage and ran away to join the circus—the Carson Carnival of Traveling Wonders. The youth fell under the sway of the Swordsman, a charismatic fellow performer who teamed up with the talented Trick Shot and trained his young charge to be an expert with a bow and arrow. When Barton found his mentor embezzling funds from the show, he attempted to alert the authorities. But, instead, he suffered a beating from his roguish role model, bringing the apprenticeship to a violent end.\n\nRecovering, but separated from both Swordsman and Barney, Clint continued to hone his archery aptitude, taking the name Hawkeye and wandering the world joining several circuses as he searched for greater purpose. Inspiration struck when Barton witnessed Iron Man in action and decided he would use his unique skill set to become a costumed Super Hero. Unfortunately for the would-be do-gooder, his initial outing ended in a misunderstanding that saw him labeled a criminal.\n\nBefore Barton could correct public perception, destiny brought him in contact with The Black Widow. The brave bow slinger immediately fell in love with the sultry spy. Using his attraction to manipulate the smitten archer, Widow set him against her nemesis, Iron Man. The duo clashed several times with the Armored Avenger before the Russian suffered an injury and escaped, leaving Hawkeye to reconsider his path and attempt to get back on the straight and narrow.\n\nA chance encounter changed Hawkeye’s fortunes, as the bowman saved butler Edwin Jarvis and his mother from a mugger, earning him the gratitude of a key Avengers ally and an opportunity to align with Earth’s Mightiest Heroes. With Captain America recruiting a revamped roster for the team, Jarvis arranged for Clint to audition before Iron Man, impressing his old enemy and gaining his sponsorship. Hawkeyes would join Cap, Quicksilver, and The Scarlet Witch as the Avengers’ second generation, kicking off a long and distinguished tenure with the team.\n\nA Living Weapon\n\nNobody in the Marvel Universe comes close to matching Clint Barton when it comes to skilled marksmanship. Though he can easily make use of almost any weapon thanks to extensive training with Swordsman, Trick Shot, Captain America, and others, Hawkeye prefers his trademark bow. The Avenging Archer also employs an arsenal of trick arrows, including shafts that emit everything from smoke and knockout gas to a powerful electromagnetic pulse.\n\nEven stripped of his tools, Hawkeye packs a punch, having mastered the martial arts and hand-to-hand combat, thanks to his friend and mentor Captain America.\n\nDuring a brief stint under the codename Goliath, Barton makes use of fellow Avenger Hank Pym’s size-changing Pym particles to grow to giant-size. Years later, Clint takes on the masked identity of Ronin, proving adept at swordplay and melee fighting, but he always returns to his array of arrows.\n\nHawkeye’s most adaptable asset may be his keen mind, honed to a point as sharp as any arrowhead, thanks to years learning from other skilled leaders. Clint has captained his own Avengers teams on multiple occasions, as well as taking the reformed criminal Thunderbolts under his wing in hopes of helping the one-time rogues to follow his road to redemption. Barton possesses a sophisticated savvy that belies his blustery attitude, able to game plan calculated courses of attack and quarterback his troops in battle.\n\nHard Targets\n\nEarly on in his tenure as an Avenger, Hawkeye contends with the unwelcome return of an old foe in the form of The Swordsman, who claims he had reformed like his pupil and seeks to join the heroic alliance. Barton warns his teammates of their new recruit’s duplicity, and ultimately has his suspicions confirmed when Swordsman turns on the team, capturing Captain America; the archer defeats his one-time teacher in combat and manages to exorcise that particular demon of his past.\n\nDuring a period where Clint leaves the Avengers, he takes a job as security chief at Cross Technological Enterprises, but uncovers corruption within the organization, pitting him against the villain Crossfire. Hawkeyes and new ally Mockingbird triumph over their adversary. This comes at the cost of the former’s hearing, as he uses a sonic arrow at close range to thwart his foe. Crossfire would return, seeking revenge on the duo who undid him, but the unlikely aid of aged actress Moira Brandon help the heroes triumph once more.\n\nMore than once in recent times, Clint contends with roguish imposters seeking to co-opt some aspect of his identity. During his “Dark Reign,” Norman Osborn dubs the psychotic Bullseye as his “Hawkeye” on a team of twisted Avengers, leaving Barton as Ronin to storm the villains’ headquarters and attempt to take down the operation himself; ultimately Mockingbird and others come to the marksman’s rescue. Later, Baron Zemo, who blames Barton for taking leadership of the Thunderbolts from him, sets Clint’s own brother, Barney, against him as the new Trickshot. After several skirmishes between the siblings, they ultimately reconcile and the elder Barton assists Hawkeye in defending his New York apartment building against the Russian mob.\n\nAvenging Allies\n\nClint Barton finds a surrogate family and the stable home he lacked through his early years as a stalwart member of the Avengers. Though Hawkeye clashes with Captain America when they first meet—the brash youth questioning the leadership of the seasoned super soldier—the two ultimately form a close bond, with Cap taking on the role of first mentor and later proud peer. The archer also counts former enemy Iron Man and the temporarily time-displaced Two-Gun Kid among his closest confidantes within the ranks of Earth’s Mightiest Heroes.\n\nOur merry marksman doubles as a hopeless romantic and has fallen for more than one of his teammates. His initial dalliance with Black Widow convinces the Soviet to reform; though the two have rekindled their affair more than once over the years, they find firmer footing as friends. Upon joining the Avengers, Hawkeye pines for The Scarlet Witch, earning the ire of her twin brother, Quicksilver. Clint even quits the team when Wanda Maximoff chooses the android Vision over him, but all parties eventually reconcile. After only one adventure alongside the magnificent Mockingbird, a smitten Clint proposes marriage to beautiful Bobbi Morse, and the duo go west together to found a new team of Avengers. Unfortunately, the honeymoon does not last forever, and these two strong-willed heroes aren’t able to make their marriage work, though they always have each other’s backs.\n\nPerhaps nobody understands the Avenging Archer better than his protégé and namesake Kate Bishop, AKA Hawkeye too. Though mentoring a successor would mark maturity for most, more often than not Clint learns lessons from this extraordinary young woman, as much as vice versa. The two have been estranged on more than one occasion, stemming from conflicting philosophies when it comes to mission objectives. But, inevitably, they always reconcile, two straight arrows that fly true together.\n\nHEIGHT\n\n6'3''\n\nWEIGHT\n\n230 lbs.\n\nGENDER\n\nMale\n\nEYES\n\nBlue\n\nHAIR\n\nBlond\n\nUNIVERSE\n\nMarvel Universe\n\nOTHER ALIASES\n\nClinton Francis \"Clint\" Barton, Dr. Rogers, The Marksman, Br'er Hawkeye, Seagate Superhuman Cellblock Prisoner 334556, Longbow, Goliath, Father Time, Ronin, Bruno, Louis, Robin Hood, The Hawkeye Kid, Golden Archer, Purple Man, Impersonated Constrictor & Dreadknight\n\nEDUCATION\n\nHigh school (unfinished)\n\nPLACE OF ORIGIN\n\nWaverly, Iowa\n\nIDENTITY\n\nPublicly known\n\nKNOWN RELATIVES\n\nEdith Barton (mother, deceased), Harold Barton (father, deceased), Charles Bernard \"Barney\" Barton (brother, deceased), Barbara Morse \"Bobbi\" Barton (Mockingbird, ex-wife)\n\nPOWERS\n\nHand-to-Hand CombatSuperior Marksmanship\n\nGROUP AFFILIATION\n\nDefenders\nHitting the Mark\n\nHawkeye has come a long way since being an orphaned boy seeking purpose—he has traveled to outer space and other dimensions alongside his era’s most decorated champions, faced down ferocious foes who dwarfed his abilities with their seemingly omnipotent power, and even overcome seeming death to continue his suspenseful tales.\n\nFollowing a leave of absence from the Avengers, Clint sought to rejoin his heroic fraternity, but found most members of the team to have disappeared, claimed by a mysterious source. Hawkeye led a small team after the cosmic-powered Collector, the entity responsible for the abductions. With all his fellows defeated, Barton refused to lose, pitting his unerring aim and unyielding spirit against the Elder of the Universe. In the end, Clint let loose with a single arrow that proved the Collector’s undoing, succeeding in winning the day where the likes of Thor and Iron Man had come out short, proving no man with two hands and the spirit of an Avenger should ever be underestimated.\n\nOn the darkest day in Avengers history, when a mad Scarlet Witch turned on the team and unleashed simulacrums of their greatest enemies, Hawkeye went out in a blaze of glory, sacrificing his life to defend his fellows against the forces of the alien Kree. When Wanda Maximoff altered the timeline and created the House of M, she unconsciously restored Clint to life, allowing him to pick up where he left off. Rejoining a cadre of Avengers when reality realigned, Barton would lead the charge against the Skrulls’ Secret Invasion, Norman Osborn’s Dark Reign, and the Siege of Asgard that brought about a new Heroic Age.\n\nWhen he’s not busy with Earth’s Mightiest Heroes, Clint Barton spends his days off continuing to do good in the community. Becoming superintendent of an apartment building in Brooklyn, the everyman Avenger insinuated himself into the lives of his tenants, trying to provide a better quality of existence in a manner less flashy than battling Super Villains or fending off extraterrestrial incursions. However, when danger descended on his homestead in the form of Russian mobsters and silent assassins, Clint rallied his allies, including Kate Bishop and his brother Barney, to safeguard the common man against those who would prey upon them.\n\nWhether bringing his bow and arrow to Earth’s defense on a grand scale or taking to the streets and sticking up for the little guy, Hawkeye can be counted on to stand fast as one of the Marvel Universe’s staunchest champions for justice."
  },
  {
    "id": "6a191b7a-3202-4475-ab5e-7680befe0e27",
    "name": "THOR",
    "photo": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/004tho_ons_crd_03.jpg",
    "bio": "THOR ODINSON\nTHOR\nThe son of Odin uses his mighty abilities as the God of Thunder to protect his home Asgard and planet Earth alike.\nOVERVIEW\nON SCREEN PROFILE\nON SCREEN FULL REPORT\nIN COMICS PROFILE\nIN COMICS FULL REPORT\n6\nDURABILITY\n6\nENERGY\n4\nFIGHTING SKILLS\n2\nINTELLIGENCE\n7\nSPEED\n7\nSTRENGTH\nBIOGRAPHY\n\nThe very skies tremble in his presence. He commands the mystical hammer Mjolnir to protect Asgard and Earth. He is the son of Odin, Prince of Asgard. He is the God of Thunder. He is Thor.\n\nThe God of Thunder\n\nThor was born to the King of the Asgardian Gods, Odin Borson, and the Earth Goddess Gaea. He grew up in Asgard under Odin's tutelage and trained in his footsteps to one day lead Asgard. Besides Odin, his stepmother Frigga and his adopted brother Loki are the only family he know, alongside his best friends Sif, Balder, and the Warriors Three.\n\nThroughout his youth, Thor tested his limits on dangerous missions and became worthy of the Uru hammer Mjolnir, using it to save Sif from the Death Goddess Hela. While the hammer wields destructive powers, it also has the power to build and Thor also uses it to consecrate treaties and bless weddings.\n\nIn Thor's coming of age, he fell through a portal and battled the demigod Hercules. Equal in strength, they fought until Zeus halted their encounter, sending Thor back to Asgard and wiping the memories of both warriors. During the 9th Century, Thor spent time on Earth, leading Vikings into battle. It was not until Thor's loyal Vikings attacked a Christian monastery that he turned his back on his followers, leaving Earth and spending centuries in Asgard.\n\nDuring his time in Asgard, Odin casted Thor into the mortal guise of Siegmund to retrieve the Rhinegold Ring from the dragon Fafnir. When Siegmund took away another's wife, Frigga compelled Odin to kill Thor, but Thor survived as Siegmund's son Siegfried. Odin succeeded at obtaining the Rhinegold Ring from Siegfried, then restored Thor to life without any memories of his former identities.\n\nWhen Thor's battle-hungry appetite led him to break a treaty between Asgard and the Frost Giants, Odin banished him to Earth as a lesson in humility in the form of Dr. Donald Blake. As a human, he had a limp and worked as a physician. When he was compelled by Odin to go to Norway, he came upon extraterrestrials known as the Kronans and fled into a cave. There, he found a gnarled cane and used it to try and escape; he struck it against a rock, and it became Mjolnir. The mallet then restored his memories and returned him to his former glory as the mighty God of Thunder.\n\nWhen Loki became a menace and deceived his brother Thor on Earth, Thor saw through his lies and banded together with Iron Man, the Hulk, Ant-Man, and Wasp to found the Avengers. Alongside the Avengers, Thor is a leader, master hand-to-hand combatant, and talented swordsman.\n\nWorthy Warrior and Weaponry\n\nThor, son of Gods, has enhanced longevity, augmented by the Golden Apples of Idunn. He also possesses superhuman strength, speed, agility, durability and immunity to most diseases.\n\nThor's greatest weapon, and closest ally, is Mjolnir, an enchanted hammer forged from Uru metal, which has power over storms and can generate energy blasts known as anti-force. Thor uses this hammer to summon rain, wind, lightning, and thunder, though he has also been known to produce lightning from his hands. While Mjolnir can manipulate weather patterns, it extends godhood and many other abilities to its commander. When spun, the mallet can allow Thor to fly, hover, and even open portals to other dimensions and realms. When thrown, it acts as a sort of boomerang, destroying all things or beings in its path before returning to its owner.\n\nWhen Thor became unworthy of holding Mjolnir, he used Jarnbjorn, a deadly war ax.\n\nEnemies of the God\n\nThose Who Sit Above in Shadow are a consortium of wicked Gods that feed off the energies resulting from Asgard's repeated destruction, which is known as Ragnarok or \"The Twilight of the Gods.\" The consortium recreates Asgard after each Ragnarok, resulting in an endless loop of creation, destruction, and rebirth.\n\nHela, the Goddess of Death, is Thor's niece, best known for stealing mortal souls. Once time Thor faces her, she scars him across his face. She also punishes him for releasing her souls and curses him so that he could not heal his injuries, but also not die.\n\nLoki, an Asgardian menace, forever seeks to sow chaos out of his jealousy towards his adopted brother Thor. Whether he is trying to steal the Golden Apples of Idunn or posing as Odin, he's rarely an ally.\n\nThe Celestials are the omnipotent judges of all the Gods, are limitless in their power, and often serve as foils to the Asgardian royalty.\n\nKarnilla, the Norn Queen and ancestral Asgardian enemy, possesses powerful mystic talismans called Norn Stones. These stones are semi-sentient and are known to refuse the commands of unworthy holders, just as Mjolnir does so. She has used these many times in her battles with the God of Thunder.\n\nThe Ennead Egyptian/Heliopolitan Death God Seth wages war on the Asgardians and captures Odin, imprisoning him in his Black Pyramid. Once Thor rescues Odin, and Odin bests Seth in Asgard.\n\nSurtur, a fire demon, attacks Asgard so that he might claim the eternal flame and complete the forging of his sword Twilight. He proves to be a menace time and time again for Asgard and Earth, eternally stuck in a battle with Odin. The Sons of Muspel also serve Surtur against the realm.\n\nAbsorbing Man, Amora the Enchantress, Skurge the Executioner, Ego the Living Planet, Demon Lord Mephisto, Mangog, and Malekith the Accursed, the Dark Elf from Svartalfheim are also known foes to Thor.\n\nAllies, Friends, Family\n\nThor's allies include Odin Borson, his father and King of the Asgardians; his mother and Earth Goddess Gaea; and his stepmother Frigga. His best friends include Sif (whom he has intermittent romances with), Balder, and the Warriors Three: Fandral the Dashing, Hogun the Grim, and Volstagg the Enormous.\n\nThe God Heimdall is the guardian of Asgard. He protects the Asgardian borders and the Bifrost, and is forever an ally to Thor.\n\nOn Earth, Thor bands together with Iron Man, the Hulk, Ant-Man, and the Wasp to found the Avengers. Later, when the Hulk leaves, Steve Rogers, AKA Captain America, joins the fold and becomes close friends with the God.\n\nBeta Ray Bill, a warrior alien, bests Thor in battle one time. As a reward for his strength, Odin creates a new hammer known as Stormbreaker for Bill. Bill subsequently fights alongside Thor, the Avengers, and Fantastic Four during an engagement on Earth in battle with Surtur.\n\nEric Masterson, an acquaintance of one of Thor's secret identities, Sigurd Jarlson, becomes bonded to Thor and acts a guise for him. He, occasionally, gains control of their shared body, and even takes on the codename Thunderstrike.\n\nJane Foster, a human nurse that Donald Blake falls in love with, often finds herself wrapped up in Thor's orbit, whether romantically or as an ally. She also proves to be worthy of Mjolnir and even takes on the mantle of Thor.\n\nHEIGHT\n\nThor: 6’6”, Donald Blake: 5’9”\n\nWEIGHT\n\nThor: 640 lbs., Donald Blake: 150 lbs.\n\nGENDER\n\nMale\n\nEYES\n\nBlue\n\nHAIR\n\nBlond\n\nUNIVERSE\n\nMarvel Universe\n\nOTHER ALIASES\n\nDonald M. Blake, God of Thunder, Son of Odin, The Thunderer, Lord of Asgard, Jake Olson, Sigurd Jarlson, Donar, Donner, Hloriddi, Unhappy Hrungnir’s Playmate, Veur, Hrodr’s Foe-Man, Longbeard’s Son, Vingthor the Hurler, Siegfried, Siegmund, Woe-King, (impersonated) Hercules, Harokin, Freya, formerly bound to Eric Masterson\n\nEDUCATION\n\n(Thor) Tutored by scholars of Asgard, (Blake) MD\n\nPLACE OF ORIGIN\n\nA cave in Norway\n\nIDENTITY\n\n(as Donald Blake) Secret\n\nKNOWN RELATIVES\n\nGaea (mother), Frigga (adoptive mother), Odin Borson (father, deceased), Sigyn (sister-in-law), Solveig (sister-in-law, deceased), Loki (adoptive brother), Balder, Vidar (half-brothers), Vili, Ve (paternal uncles, deceased), Bor Burison (paternal grandfather, deceased), Bestia (paternal grandmother, presumed deceased), Buri (Tiwaz, great- grandfather), Bolthorn (great-grandfather, presumed deceased), Jormungand (Midgard Serpent), Fenris Wolf (nephew), Hela (niece), large extended family via Gaea and others\n\nPOWERS\n\nOdinpower\"Warrior's Madness\" (Berserker Rage)Superhuman StrengthSuperhuman DurabilitySuperhuman SpeedSuperhuman ReflexesControl of ElementsHand-to-Hand CombatSword-Fighting\n\nGROUP AFFILIATION\n\nAvengers\nRolling Thunder\n\nThor has traveled across the realms, battling all enemies of Asgard and Earth, including the Death Goddess Hela and Olympian demigod Hercules. Though both Thor and Hercules fought on opposite sides during the Norwegian and Greek war in the year 1,000, they eventually teamed up and remain friendly rivals. It was his time on Earth leading the Vikings that began the Norwegian myth of the God of Thunder.\n\nIn one iteration of Asgard, Thor's thirst for battle led him to break an Asgardian treaty with the Frost Giants, leading Odin to punish him; Odin sent him to Earth as Dr. Donald Blake. When Blake discovered that he is the Norse God of Thunder known as Thor and is reunited with Mjolnir, he chose to divide his time between his life as an ordinary human doctor and an immortal God.\n\nAs Blake, he fell in love with the human Jane Foster. When he requested permission from Odin to marry her, Odin refused and told Thor he wasn't allowed to share his true identity with her. His affinity for Earth has caused many arguments and rifts between him and his father.\n\nWhen Loki took advantage of his brother's love of Earth, Thor sought the help of Iron Man, the Hulk, Ant-Man, and the Wasp to ward off the Asgardian menace. His trickery led Thor and these super powered individuals to found the Super Hero group called the Avengers.\n\nBalancing his dual lives, Thor continued to pursue Foster. Foster was granted temporary Goddess status, but Odin required proof of her worth. He set impossible tasks for her on Asgard, but she was unable to cope and returned to Earth, eventually marrying a man named Keith Kincaid. After this disappointing decision, Thor reunited with his friend Sif to share a romance.\n\nThor continued as Asgard's greatest defender, fighting off terrible foes such as the evil Mangog who disguised himself as Odin. During his reign, he bested Thor along with his allies the Warriors Three, but Thor ultimately defeated Mangog.\n\nWhen Ragnarok threatened Asgard's demise, Roger \"Red\" Norvell took up Thor's mantle using his Belt of Strength and unique gauntlets to battle the Midguard Serpent. He died in doing so, but helped the realm narrowly avoid Ragnarok.\n\nEnemies and wars aside, family drama reigned supreme as the God learned late in life who his real birth mother was. While he was born in Asgard to Odin and raised by his stepmother Frigga, the Earth Goddess Gaea actually bore him.\n\nThor, in his continued travels, encountered the alien Beta Ray Bill. Bill thought Thor to be a demon and seized Thor's hammer, proving himself worthy to wield it. Because they were so evenly matched, Odin created Stormbreaker, a new hammer to be used by Bill. Thor joined forces with Bill to help battle Sons of Muspel, demons serving the fire demon Surtur that threatened Bill's people.\n\nIt was just after this encounter that S.H.I.E.L.D. Director Nick Fury helped Thor establish a new identity and helped encourage him to keep in touch with humanity as Sigurd Jarlson, a construction worker.\n\nWhen the Casket of Ancient Winters was unleashed on Earth, it ushered forth Surtur and the cyclical end of Asgard known as Ragnarok. Surtur went to war with Asgard, and Thor joined Beta Ray Bill, the Avengers, and Fantastic Four to stop Surtur. Loki joined the fight, battling alongside Thor and Odin. Odin casted himself and Surtur from Asgard to seal the realms from his menace, placing them in eternal conflict.\n\nThe following battles found Thor up against Hela the Death Goddess, who disfigured and cursed him with the inability to heal his injuries. Loki saw this moment as another opportunity to defeat Thor and set Thor's enemies against him, including the Absorbing Man, the Midguard Serpent, and the Destroyer. Thor bested these foes and confronted Hela in Hel to lift the curse. Hela, in order to save herself, healed Thor's injuries and removed the spell.\n\nJust as one death goddess was defeated, another surfaced in the form of Seth the Death God, who held Odin captive. In Thor's effort to free his father, Surtur followed. Then Odin temporarily granted Thor his Odinpower, helping him to triumph over Surtur.\n\nAfter these wars, an acquaintance of Jarlson's, Eric Masterson, aided Thor on a mission, but was nearly killed. To save him, Odin merged him with Thor. But, Thor's new guise as Eric was problematic, since he was a real man and much more complicated than Blake; often his life interfered with Thor's adventures. Alas, Eric filled in for Thor when Thor became exiled in the back of their collective mind, and even faced Loki in battle. Eric, however, was not the last human that Thor merged with. Jake Olson was the next mortal to play host to Thor, but his body proved to be less than worthy for the might of the God.\n\nTo break the Ragnarok cycle and foil Those Who Sit Above in Shadow, Thor let Asgard fall, allowing himself to presumably die. His demise proved false, though, when it was revealed that he was actually sent to a limbo-like dimension.\n\nDuring the Super Hero Civil War, Tony Stark was desperate for Thor's assistance and cloned Thor from one of his hairs to create a cybernetic version of him known as Ragnarok. The clone lacked moral sense, though, and became an enemy of the Avengers.\n\nWhen Thor arrived to limbo, it expelled his Donald Blake aspect back to Earth. Mjolnir also returned to Earth, so Blake retrieved it and then convinced Thor to come back from limbo to reestablish Asgard; Thor did so by moving it from a different to its new home hovering over Broxton, Oklahoma. There, Thor discovered Iron Man's Thor clone and the implementation of the Superhuman Registration Act. He then departed from the Avengers and devoted himself to restoring the slain Asgardians from Ragnarok.\n\nDuring this restoration process, Loki schemed and mimicked Sif, who was trapped in the dying Rose Chamber's body. Loki drew out Balder, a prospective ruler and son to Odin, and revived Bor, Odin's father. Unaware of who Bor was, Thor slayed him, breaking Mjolnir in the process. Loki called Thor a traitor and Balder exiled him from Asgard.\n\nThor then turned to Doctor Strange to help him restore Mjolnir. It was bonded to Thor's life force so that any injury to the hammer would affect Thor. It was then that Thor learned of Sif's fate, allowing him to restore her to her body. Sif, the Warriors Three, and Thor then chose to settle in exile in Broxton before Asgard was finally restored to its own realm.\n\nThor Odinson eventually became unworthy of Mjolnir and his former lover Jane Foster took up the mantle of Thor in his stead. Possessing all his godhood and powers via the hammer, she battled as the Goddess of Thunder. The Odinson, along with his new weapon, the battle ax Jarnbjorn, departed to fight across the realms on his own.\n\nWhen Jane Foster's cancer-ridden body could no longer take the rigors of godhood, she chose to battle a rampaging Mangog one last time in an effort to save Asgard from total destruction. In her final battle, she managed to defeat the monster, and allowed the Asgardian people time to escape the destruction. Jane Foster then stepped down from the mantle, allowing the God of Thunder to serve as Thor once again."
  }
]